{
    "PAD_None": 0,
    "BOS_None": 1,
    "EOS_None": 2,
    "MASK_None": 3,
    "Bar_None": 4,
    "Pitch_21": 5,
    "Pitch_22": 6,
    "Pitch_23": 7,
    "Pitch_24": 8,
    "Pitch_25": 9,
    "Pitch_26": 10,
    "Pitch_27": 11,
    "Pitch_28": 12,
    "Pitch_29": 13,
    "Pitch_30": 14,
    "Pitch_31": 15,
    "Pitch_32": 16,
    "Pitch_33": 17,
    "Pitch_34": 18,
    "Pitch_35": 19,
    "Pitch_36": 20,
    "Pitch_37": 21,
    "Pitch_38": 22,
    "Pitch_39": 23,
    "Pitch_40": 24,
    "Pitch_41": 25,
    "Pitch_42": 26,
    "Pitch_43": 27,
    "Pitch_44": 28,
    "Pitch_45": 29,
    "Pitch_46": 30,
    "Pitch_47": 31,
    "Pitch_48": 32,
    "Pitch_49": 33,
    "Pitch_50": 34,
    "Pitch_51": 35,
    "Pitch_52": 36,
    "Pitch_53": 37,
    "Pitch_54": 38,
    "Pitch_55": 39,
    "Pitch_56": 40,
    "Pitch_57": 41,
    "Pitch_58": 42,
    "Pitch_59": 43,
    "Pitch_60": 44,
    "Pitch_61": 45,
    "Pitch_62": 46,
    "Pitch_63": 47,
    "Pitch_64": 48,
    "Pitch_65": 49,
    "Pitch_66": 50,
    "Pitch_67": 51,
    "Pitch_68": 52,
    "Pitch_69": 53,
    "Pitch_70": 54,
    "Pitch_71": 55,
    "Pitch_72": 56,
    "Pitch_73": 57,
    "Pitch_74": 58,
    "Pitch_75": 59,
    "Pitch_76": 60,
    "Pitch_77": 61,
    "Pitch_78": 62,
    "Pitch_79": 63,
    "Pitch_80": 64,
    "Pitch_81": 65,
    "Pitch_82": 66,
    "Pitch_83": 67,
    "Pitch_84": 68,
    "Pitch_85": 69,
    "Pitch_86": 70,
    "Pitch_87": 71,
    "Pitch_88": 72,
    "Pitch_89": 73,
    "Pitch_90": 74,
    "Pitch_91": 75,
    "Pitch_92": 76,
    "Pitch_93": 77,
    "Pitch_94": 78,
    "Pitch_95": 79,
    "Pitch_96": 80,
    "Pitch_97": 81,
    "Pitch_98": 82,
    "Pitch_99": 83,
    "Pitch_100": 84,
    "Pitch_101": 85,
    "Pitch_102": 86,
    "Pitch_103": 87,
    "Pitch_104": 88,
    "Pitch_105": 89,
    "Pitch_106": 90,
    "Pitch_107": 91,
    "Pitch_108": 92,
    "Velocity_1": 93,
    "Velocity_3": 94,
    "Velocity_5": 95,
    "Velocity_7": 96,
    "Velocity_9": 97,
    "Velocity_11": 98,
    "Velocity_13": 99,
    "Velocity_15": 100,
    "Velocity_17": 101,
    "Velocity_19": 102,
    "Velocity_21": 103,
    "Velocity_23": 104,
    "Velocity_25": 105,
    "Velocity_27": 106,
    "Velocity_29": 107,
    "Velocity_31": 108,
    "Velocity_33": 109,
    "Velocity_35": 110,
    "Velocity_37": 111,
    "Velocity_39": 112,
    "Velocity_41": 113,
    "Velocity_43": 114,
    "Velocity_45": 115,
    "Velocity_47": 116,
    "Velocity_49": 117,
    "Velocity_51": 118,
    "Velocity_53": 119,
    "Velocity_55": 120,
    "Velocity_57": 121,
    "Velocity_59": 122,
    "Velocity_61": 123,
    "Velocity_63": 124,
    "Velocity_65": 125,
    "Velocity_67": 126,
    "Velocity_69": 127,
    "Velocity_71": 128,
    "Velocity_73": 129,
    "Velocity_75": 130,
    "Velocity_77": 131,
    "Velocity_79": 132,
    "Velocity_81": 133,
    "Velocity_83": 134,
    "Velocity_85": 135,
    "Velocity_87": 136,
    "Velocity_89": 137,
    "Velocity_91": 138,
    "Velocity_93": 139,
    "Velocity_95": 140,
    "Velocity_97": 141,
    "Velocity_99": 142,
    "Velocity_101": 143,
    "Velocity_103": 144,
    "Velocity_105": 145,
    "Velocity_107": 146,
    "Velocity_109": 147,
    "Velocity_111": 148,
    "Velocity_113": 149,
    "Velocity_115": 150,
    "Velocity_117": 151,
    "Velocity_119": 152,
    "Velocity_121": 153,
    "Velocity_123": 154,
    "Velocity_125": 155,
    "Velocity_127": 156,
    "Duration_0.1.8": 157,
    "Duration_0.2.8": 158,
    "Duration_0.3.8": 159,
    "Duration_0.4.8": 160,
    "Duration_0.5.8": 161,
    "Duration_0.6.8": 162,
    "Duration_0.7.8": 163,
    "Duration_1.0.8": 164,
    "Duration_1.1.8": 165,
    "Duration_1.2.8": 166,
    "Duration_1.3.8": 167,
    "Duration_1.4.8": 168,
    "Duration_1.5.8": 169,
    "Duration_1.6.8": 170,
    "Duration_1.7.8": 171,
    "Duration_2.0.8": 172,
    "Duration_2.1.8": 173,
    "Duration_2.2.8": 174,
    "Duration_2.3.8": 175,
    "Duration_2.4.8": 176,
    "Duration_2.5.8": 177,
    "Duration_2.6.8": 178,
    "Duration_2.7.8": 179,
    "Duration_3.0.8": 180,
    "Duration_3.1.8": 181,
    "Duration_3.2.8": 182,
    "Duration_3.3.8": 183,
    "Duration_3.4.8": 184,
    "Duration_3.5.8": 185,
    "Duration_3.6.8": 186,
    "Duration_3.7.8": 187,
    "Duration_4.0.4": 188,
    "Duration_4.1.4": 189,
    "Duration_4.2.4": 190,
    "Duration_4.3.4": 191,
    "Duration_5.0.4": 192,
    "Duration_5.1.4": 193,
    "Duration_5.2.4": 194,
    "Duration_5.3.4": 195,
    "Duration_6.0.4": 196,
    "Duration_6.1.4": 197,
    "Duration_6.2.4": 198,
    "Duration_6.3.4": 199,
    "Duration_7.0.4": 200,
    "Duration_7.1.4": 201,
    "Duration_7.2.4": 202,
    "Duration_7.3.4": 203,
    "Duration_8.0.4": 204,
    "Duration_8.1.4": 205,
    "Duration_8.2.4": 206,
    "Duration_8.3.4": 207,
    "Duration_9.0.4": 208,
    "Duration_9.1.4": 209,
    "Duration_9.2.4": 210,
    "Duration_9.3.4": 211,
    "Duration_10.0.4": 212,
    "Duration_10.1.4": 213,
    "Duration_10.2.4": 214,
    "Duration_10.3.4": 215,
    "Duration_11.0.4": 216,
    "Duration_11.1.4": 217,
    "Duration_11.2.4": 218,
    "Duration_11.3.4": 219,
    "Duration_12.0.4": 220,
    "Position_0": 221,
    "Position_1": 222,
    "Position_2": 223,
    "Position_3": 224,
    "Position_4": 225,
    "Position_5": 226,
    "Position_6": 227,
    "Position_7": 228,
    "Position_8": 229,
    "Position_9": 230,
    "Position_10": 231,
    "Position_11": 232,
    "Position_12": 233,
    "Position_13": 234,
    "Position_14": 235,
    "Position_15": 236,
    "Position_16": 237,
    "Position_17": 238,
    "Position_18": 239,
    "Position_19": 240,
    "Position_20": 241,
    "Position_21": 242,
    "Position_22": 243,
    "Position_23": 244,
    "Position_24": 245,
    "Position_25": 246,
    "Position_26": 247,
    "Position_27": 248,
    "Position_28": 249,
    "Position_29": 250,
    "Position_30": 251,
    "Position_31": 252,
    "Position_32": 253,
    "Position_33": 254,
    "Position_34": 255,
    "Position_35": 256,
    "Position_36": 257,
    "Position_37": 258,
    "Position_38": 259,
    "Position_39": 260,
    "Position_40": 261,
    "Position_41": 262,
    "Position_42": 263,
    "Position_43": 264,
    "Position_44": 265,
    "Position_45": 266,
    "Position_46": 267,
    "Position_47": 268,
    "Position_48": 269,
    "Position_49": 270,
    "Position_50": 271,
    "Position_51": 272,
    "Position_52": 273,
    "Position_53": 274,
    "Position_54": 275,
    "Position_55": 276,
    "Position_56": 277,
    "Position_57": 278,
    "Position_58": 279,
    "Position_59": 280,
    "Position_60": 281,
    "Position_61": 282,
    "Position_62": 283,
    "Position_63": 284,
    "Position_64": 285,
    "Position_65": 286,
    "Position_66": 287,
    "Position_67": 288,
    "Position_68": 289,
    "Position_69": 290,
    "Position_70": 291,
    "Position_71": 292,
    "Position_72": 293,
    "Position_73": 294,
    "Position_74": 295,
    "Position_75": 296,
    "Position_76": 297,
    "Position_77": 298,
    "Position_78": 299,
    "Position_79": 300,
    "Position_80": 301,
    "Position_81": 302,
    "Position_82": 303,
    "Position_83": 304,
    "Position_84": 305,
    "Position_85": 306,
    "Position_86": 307,
    "Position_87": 308,
    "Position_88": 309,
    "Position_89": 310,
    "Position_90": 311,
    "Position_91": 312,
    "Position_92": 313,
    "Position_93": 314,
    "Position_94": 315,
    "Position_95": 316,
    "PitchDrum_27": 317,
    "PitchDrum_28": 318,
    "PitchDrum_29": 319,
    "PitchDrum_30": 320,
    "PitchDrum_31": 321,
    "PitchDrum_32": 322,
    "PitchDrum_33": 323,
    "PitchDrum_34": 324,
    "PitchDrum_35": 325,
    "PitchDrum_36": 326,
    "PitchDrum_37": 327,
    "PitchDrum_38": 328,
    "PitchDrum_39": 329,
    "PitchDrum_40": 330,
    "PitchDrum_41": 331,
    "PitchDrum_42": 332,
    "PitchDrum_43": 333,
    "PitchDrum_44": 334,
    "PitchDrum_45": 335,
    "PitchDrum_46": 336,
    "PitchDrum_47": 337,
    "PitchDrum_48": 338,
    "PitchDrum_49": 339,
    "PitchDrum_50": 340,
    "PitchDrum_51": 341,
    "PitchDrum_52": 342,
    "PitchDrum_53": 343,
    "PitchDrum_54": 344,
    "PitchDrum_55": 345,
    "PitchDrum_56": 346,
    "PitchDrum_57": 347,
    "PitchDrum_58": 348,
    "PitchDrum_59": 349,
    "PitchDrum_60": 350,
    "PitchDrum_61": 351,
    "PitchDrum_62": 352,
    "PitchDrum_63": 353,
    "PitchDrum_64": 354,
    "PitchDrum_65": 355,
    "PitchDrum_66": 356,
    "PitchDrum_67": 357,
    "PitchDrum_68": 358,
    "PitchDrum_69": 359,
    "PitchDrum_70": 360,
    "PitchDrum_71": 361,
    "PitchDrum_72": 362,
    "PitchDrum_73": 363,
    "PitchDrum_74": 364,
    "PitchDrum_75": 365,
    "PitchDrum_76": 366,
    "PitchDrum_77": 367,
    "PitchDrum_78": 368,
    "PitchDrum_79": 369,
    "PitchDrum_80": 370,
    "PitchDrum_81": 371,
    "PitchDrum_82": 372,
    "PitchDrum_83": 373,
    "PitchDrum_84": 374,
    "PitchDrum_85": 375,
    "PitchDrum_86": 376,
    "PitchDrum_87": 377,
    "Chord_min": 378,
    "Chord_maj": 379,
    "Chord_dim": 380,
    "Chord_aug": 381,
    "Chord_sus2": 382,
    "Chord_sus4": 383,
    "Chord_7dom": 384,
    "Chord_7min": 385,
    "Chord_7maj": 386,
    "Chord_7halfdim": 387,
    "Chord_7dim": 388,
    "Chord_7aug": 389,
    "Chord_9maj": 390,
    "Chord_9min": 391,
    "Rest_0.1.8": 392,
    "Rest_0.2.8": 393,
    "Rest_0.3.8": 394,
    "Rest_0.4.8": 395,
    "Rest_0.5.8": 396,
    "Rest_0.6.8": 397,
    "Rest_0.7.8": 398,
    "Rest_1.0.4": 399,
    "Rest_1.1.4": 400,
    "Rest_1.2.4": 401,
    "Rest_1.3.4": 402,
    "Rest_2.0.2": 403,
    "Rest_2.1.2": 404,
    "Rest_3.0.2": 405,
    "Rest_3.1.2": 406,
    "Rest_4.0.2": 407,
    "Rest_4.1.2": 408,
    "Rest_5.0.2": 409,
    "Rest_5.1.2": 410,
    "Rest_6.0.2": 411,
    "Rest_6.1.2": 412,
    "Rest_7.0.2": 413,
    "Rest_7.1.2": 414,
    "Rest_8.0.2": 415,
    "Rest_8.1.2": 416,
    "Rest_9.0.2": 417,
    "Rest_9.1.2": 418,
    "Rest_10.0.2": 419,
    "Rest_10.1.2": 420,
    "Rest_11.0.2": 421,
    "Rest_11.1.2": 422,
    "Rest_12.0.2": 423,
    "Tempo_40.0": 424,
    "Tempo_46.77": 425,
    "Tempo_53.55": 426,
    "Tempo_60.32": 427,
    "Tempo_67.1": 428,
    "Tempo_73.87": 429,
    "Tempo_80.65": 430,
    "Tempo_87.42": 431,
    "Tempo_94.19": 432,
    "Tempo_100.97": 433,
    "Tempo_107.74": 434,
    "Tempo_114.52": 435,
    "Tempo_121.29": 436,
    "Tempo_128.06": 437,
    "Tempo_134.84": 438,
    "Tempo_141.61": 439,
    "Tempo_148.39": 440,
    "Tempo_155.16": 441,
    "Tempo_161.94": 442,
    "Tempo_168.71": 443,
    "Tempo_175.48": 444,
    "Tempo_182.26": 445,
    "Tempo_189.03": 446,
    "Tempo_195.81": 447,
    "Tempo_202.58": 448,
    "Tempo_209.35": 449,
    "Tempo_216.13": 450,
    "Tempo_222.9": 451,
    "Tempo_229.68": 452,
    "Tempo_236.45": 453,
    "Tempo_243.23": 454,
    "Tempo_250.0": 455,
    "TimeSig_3/8": 456,
    "TimeSig_12/8": 457,
    "TimeSig_6/8": 458,
    "TimeSig_5/4": 459,
    "TimeSig_6/4": 460,
    "TimeSig_3/4": 461,
    "TimeSig_2/4": 462,
    "TimeSig_1/4": 463,
    "TimeSig_4/4": 464
}