{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "BAR_END": 5,
      "BAR_START": 6,
      "NOTE_OFF=62": 7,
      "NOTE_ON=62": 8,
      "NOTE_OFF=67": 9,
      "NOTE_ON=67": 10,
      "NOTE_OFF=65": 11,
      "NOTE_ON=65": 12,
      "NOTE_OFF=60": 13,
      "NOTE_ON=60": 14,
      "NOTE_OFF=64": 15,
      "NOTE_ON=64": 16,
      "NOTE_OFF=69": 17,
      "NOTE_ON=69": 18,
      "NOTE_OFF=72": 19,
      "NOTE_ON=72": 20,
      "NOTE_OFF=74": 21,
      "NOTE_ON=74": 22,
      "NOTE_OFF=63": 23,
      "NOTE_ON=63": 24,
      "NOTE_OFF=55": 25,
      "NOTE_ON=55": 26,
      "NOTE_OFF=57": 27,
      "NOTE_ON=57": 28,
      "NOTE_OFF=58": 29,
      "NOTE_ON=58": 30,
      "NOTE_OFF=68": 31,
      "NOTE_ON=68": 32,
      "NOTE_OFF=70": 33,
      "NOTE_ON=70": 34,
      "NOTE_OFF=61": 35,
      "NOTE_ON=61": 36,
      "TIME_DELTA=0.03125": 37,
      "NOTE_OFF=66": 38,
      "NOTE_ON=66": 39,
      "NOTE_OFF=71": 40,
      "NOTE_ON=71": 41,
      "NOTE_OFF=59": 42,
      "NOTE_ON=59": 43,
      "NOTE_OFF=73": 44,
      "NOTE_ON=73": 45,
      "NOTE_OFF=76": 46,
      "NOTE_ON=76": 47,
      "NOTE_OFF=56": 48,
      "NOTE_ON=56": 49,
      "NOTE_OFF=75": 50,
      "NOTE_ON=75": 51,
      "NOTE_OFF=77": 52,
      "NOTE_ON=77": 53,
      "TIME_DELTA=0.0625": 54,
      "NOTE_OFF=53": 55,
      "NOTE_ON=53": 56,
      "TIME_DELTA=0.125": 57,
      "NOTE_OFF=79": 58,
      "NOTE_ON=79": 59,
      "NOTE_OFF=50": 60,
      "NOTE_ON=50": 61,
      "NOTE_OFF=52": 62,
      "NOTE_ON=52": 63,
      "TIME_DELTA=0.25": 64,
      "NOTE_OFF=54": 65,
      "NOTE_ON=54": 66,
      "TIME_DELTA=0.09375": 67,
      "NOTE_OFF=78": 68,
      "NOTE_ON=78": 69,
      "NOTE_OFF=51": 70,
      "NOTE_ON=51": 71,
      "NOTE_OFF=48": 72,
      "NOTE_ON=48": 73,
      "NOTE_OFF=81": 74,
      "NOTE_ON=81": 75,
      "NOTE_OFF=80": 76,
      "NOTE_ON=80": 77,
      "TIME_DELTA=0.15625": 78,
      "TIME_DELTA=0.28125": 79,
      "NOTE_OFF=49": 80,
      "NOTE_ON=49": 81,
      "TIME_DELTA=0.1875": 82,
      "TIME_DELTA=0.375": 83,
      "TIME_DELTA=0.041666666666666664": 84,
      "TIME_DELTA=0.21875": 85,
      "NOTE_OFF=82": 86,
      "NOTE_ON=82": 87,
      "TIME_DELTA=0.3125": 88,
      "NOTE_OFF=45": 89,
      "NOTE_ON=45": 90,
      "NOTE_OFF=47": 91,
      "NOTE_ON=47": 92,
      "NOTE_OFF=46": 93,
      "NOTE_ON=46": 94,
      "NOTE_OFF=84": 95,
      "NOTE_ON=84": 96,
      "NOTE_OFF=83": 97,
      "NOTE_ON=83": 98,
      "NOTE_OFF=43": 99,
      "NOTE_ON=43": 100,
      "TIME_DELTA=0.34375": 101,
      "NOTE_OFF=44": 102,
      "NOTE_ON=44": 103,
      "TIME_DELTA=0.2916666666666667": 104,
      "TIME_DELTA=0.08333333333333333": 105,
      "NOTE_OFF=86": 106,
      "NOTE_ON=86": 107,
      "TIME_DELTA=0.010416666666666666": 108,
      "NOTE_OFF=85": 109,
      "NOTE_ON=85": 110,
      "TIME_DELTA=0.40625": 111,
      "TIME_DELTA=0.5": 112,
      "TIME_DELTA=0.3333333333333333": 113,
      "TIME_DELTA=0.16666666666666666": 114,
      "NOTE_OFF=41": 115,
      "NOTE_ON=41": 116,
      "TIME_DELTA=0.20833333333333334": 117,
      "TIME_DELTA=0.010416666666666075": 118,
      "TIME_DELTA=0.4375": 119,
      "TIME_DELTA=0.020833333333333332": 120,
      "NOTE_OFF=87": 121,
      "NOTE_ON=87": 122,
      "TIME_DELTA=0.020833333333333925": 123,
      "TIME_DELTA=0.041666666666666075": 124,
      "NOTE_OFF=42": 125,
      "NOTE_ON=42": 126,
      "TIME_DELTA=0.03333333333333333": 127,
      "TIME_DELTA=0.46875": 128,
      "NOTE_OFF=88": 129,
      "NOTE_ON=88": 130,
      "TIME_DELTA=0.052083333333333336": 131,
      "TIME_DELTA=0.4166666666666667": 132,
      "NOTE_OFF=40": 133,
      "NOTE_ON=40": 134,
      "TIME_DELTA=0.2604166666666667": 135,
      "TIME_DELTA=0.052083333333333925": 136,
      "TIME_DELTA=0.07291666666666667": 137,
      "NOTE_OFF=39": 138,
      "NOTE_ON=39": 139,
      "NOTE_OFF=89": 140,
      "NOTE_ON=89": 141,
      "TIME_DELTA=0.625": 142,
      "TIME_DELTA=0.2708333333333333": 143,
      "TIME_DELTA=0.08333333333333393": 144,
      "NOTE_OFF=38": 145,
      "NOTE_ON=38": 146,
      "GENRE=OTHER": 147,
      "INST=0": 148,
      "PIECE_START": 149,
      "TIME_SIGNATURE=4_4": 150,
      "TRACK_END": 151,
      "TRACK_START": 152,
      "TIME_DELTA=0.07291666666666607": 153,
      "NOTE_OFF=36": 154,
      "NOTE_ON=36": 155,
      "TIME_DELTA=0.53125": 156,
      "TIME_DELTA=0.3229166666666667": 157,
      "TIME_DELTA=0.3020833333333333": 158,
      "TIME_DELTA=0.075": 159,
      "TIME_DELTA=0.10416666666666667": 160,
      "TIME_DELTA=0.016666666666666666": 161,
      "TIME_DELTA=0.22916666666666666": 162,
      "TIME_DELTA=0.4583333333333333": 163,
      "TIME_DELTA=0.5625": 164,
      "NOTE_OFF=37": 165,
      "NOTE_ON=37": 166,
      "TIME_DELTA=0.23958333333333334": 167,
      "TIME_DELTA=0.058333333333333334": 168,
      "TIME_DELTA=0.11458333333333333": 169,
      "TIME_DELTA=0.008333333333333333": 170,
      "TIME_DELTA=0.10416666666666607": 171,
      "TIME_DELTA=0.3541666666666667": 172,
      "TIME_DELTA=0.13541666666666666": 173,
      "TIME_DELTA=0.19791666666666666": 174,
      "TIME_DELTA=0.59375": 175,
      "TIME_DELTA=0.05": 176,
      "TIME_DELTA=0.11458333333333393": 177,
      "TIME_DELTA=0.025": 178,
      "TIME_DELTA=0.09166666666666666": 179,
      "NOTE_OFF=90": 180,
      "NOTE_ON=90": 181,
      "TIME_DELTA=0.14583333333333334": 182,
      "TIME_DELTA=0.16666666666666607": 183,
      "TIME_DELTA=0.13541666666666607": 184,
      "TIME_DELTA=0.06666666666666667": 185,
      "TIME_DELTA=0.17708333333333334": 186,
      "NOTE_OFF=91": 187,
      "NOTE_ON=91": 188,
      "TIME_DELTA=0.10833333333333334": 189,
      "TIME_DELTA=0.3854166666666667": 190,
      "TIME_DELTA=0.2604166666666661": 191,
      "TIME_DELTA=0.5416666666666666": 192,
      "TIME_DELTA=0.2916666666666661": 193,
      "TIME_DELTA=0.3645833333333333": 194,
      "TIME_DELTA=0.14583333333333393": 195,
      "TIME_DELTA=0.75": 196,
      "TIME_DELTA=0.20833333333333393": 197,
      "TIME_DELTA=0.275": 198,
      "TIME_DELTA=0.25833333333333336": 199,
      "TIME_DELTA=0.65625": 200,
      "TIME_DELTA=0.19791666666666607": 201,
      "TIME_DELTA=0.2833333333333333": 202,
      "TIME_DELTA=0.2708333333333339": 203,
      "TIME_DELTA=0.11666666666666667": 204,
      "NOTE_OFF=35": 205,
      "NOTE_ON=35": 206,
      "TIME_DELTA=0.17708333333333393": 207,
      "TIME_DELTA=0.22916666666666607": 208,
      "TIME_DELTA=0.26666666666666666": 209,
      "TIME_DELTA=0.1": 210,
      "TIME_DELTA=0.13333333333333333": 211,
      "NOTE_OFF=92": 212,
      "NOTE_ON=92": 213,
      "TIME_DELTA=0.3958333333333333": 214,
      "TIME_DELTA=0.5833333333333334": 215,
      "TIME_DELTA=0.31666666666666665": 216,
      "TIME_DELTA=0.15": 217,
      "TIME_DELTA=0.30833333333333335": 218,
      "NOTE_OFF=33": 219,
      "NOTE_ON=33": 220,
      "TIME_DELTA=0.3": 221,
      "NOTE_OFF=34": 222,
      "NOTE_ON=34": 223,
      "TIME_DELTA=0.010416666666666963": 224,
      "TIME_DELTA=0.3229166666666661": 225,
      "TIME_DELTA=0.6875": 226,
      "TIME_DELTA=0.23958333333333393": 227,
      "TIME_DELTA=0.14166666666666666": 228,
      "TIME_DELTA=0.04166666666666696": 229,
      "TIME_DELTA=0.4479166666666667": 230,
      "TIME_DELTA=0.3020833333333339": 231,
      "TIME_DELTA=0.020833333333333037": 232,
      "TIME_DELTA=0.18333333333333332": 233,
      "TIME_DELTA=0.4270833333333333": 234,
      "TIME_DELTA=0.24166666666666667": 235,
      "TIME_DELTA=0.3333333333333339": 236,
      "TIME_DELTA=0.325": 237,
      "TIME_DELTA=0.15833333333333333": 238,
      "TIME_DELTA=0.71875": 239,
      "TIME_DELTA=0.2": 240,
      "TIME_DELTA=0.21666666666666667": 241,
      "TIME_DELTA=0.225": 242,
      "TIME_DELTA=0.23333333333333334": 243,
      "TIME_DELTA=0.175": 244,
      "TIME_DELTA=0.19166666666666668": 245,
      "TIME_DELTA=0.4791666666666667": 246,
      "NOTE_OFF=93": 247,
      "NOTE_ON=93": 248,
      "TIME_DELTA=0.3541666666666661": 249,
      "TIME_DELTA=0.3416666666666667": 250,
      "TIME_DELTA=0.35": 251,
      "TIME_DELTA=0.6666666666666666": 252,
      "TIME_DELTA=0.05208333333333304": 253,
      "TIME_DELTA=0.5104166666666666": 254,
      "TIME_DELTA=0.35833333333333334": 255,
      "TIME_DELTA=0.875": 256,
      "TIME_DELTA=0.36666666666666664": 257,
      "TIME_DELTA=0.4895833333333333": 258,
      "NOTE_OFF=32": 259,
      "NOTE_ON=32": 260,
      "TIME_DELTA=0.08333333333333304": 261,
      "TIME_DELTA=0.4166666666666661": 262,
      "TIME_DELTA=0.3854166666666661": 263,
      "TIME_DELTA=0.78125": 264,
      "NOTE_OFF=94": 265,
      "NOTE_ON=94": 266,
      "TIME_DELTA=0.07291666666666696": 267,
      "TIME_DELTA=0.3645833333333339": 268,
      "TIME_DELTA=0.38333333333333336": 269,
      "TIME_DELTA=0.5208333333333334": 270,
      "TIME_DELTA=0.39166666666666666": 271,
      "TIME_DELTA=0.7083333333333334": 272,
      "TIME_DELTA=0.4": 273,
      "NOTE_OFF=31": 274,
      "NOTE_ON=31": 275,
      "TIME_DELTA=0.4083333333333333": 276,
      "TIME_DELTA=0.8125": 277,
      "TIME_DELTA=0.5520833333333334": 278,
      "TIME_DELTA=0.10416666666666696": 279,
      "TIME_DELTA=0.5729166666666666": 280,
      "TIME_DELTA=0.3958333333333339": 281,
      "TIME_DELTA=0.43333333333333335": 282,
      "TIME_DELTA=0.84375": 283,
      "TIME_DELTA=0.425": 284,
      "TIME_DELTA=0.44166666666666665": 285,
      "TIME_DELTA=0.4479166666666661": 286,
      "TIME_DELTA=0.11458333333333304": 287,
      "TIME_DELTA=0.16666666666666696": 288,
      "TIME_DELTA=0.6041666666666666": 289,
      "TIME_DELTA=0.45": 290,
      "TIME_DELTA=0.4270833333333339": 291,
      "TIME_DELTA=0.26041666666666696": 292,
      "NOTE_OFF=95": 293,
      "NOTE_ON=95": 294,
      "TIME_DELTA=0.13541666666666696": 295,
      "TIME_DELTA=0.4583333333333339": 296,
      "TIME_DELTA=1.0": 297,
      "TIME_DELTA=0.29166666666666696": 298,
      "TIME_DELTA=0.6145833333333334": 299,
      "TIME_DELTA=0.7916666666666666": 300,
      "TIME_DELTA=0.4666666666666667": 301,
      "TIME_DELTA=0.6354166666666666": 302,
      "TIME_DELTA=0.14583333333333304": 303,
      "TIME_DELTA=0.4791666666666661": 304,
      "TIME_DELTA=0.475": 305,
      "TIME_DELTA=0.20833333333333304": 306,
      "TIME_DELTA=0.90625": 307,
      "TIME_DELTA=0.6458333333333334": 308,
      "TIME_DELTA=0.27083333333333304": 309,
      "TIME_DELTA=0.48333333333333334": 310,
      "TIME_DELTA=0.19791666666666696": 311,
      "TIME_DELTA=0.5083333333333333": 312,
      "TIME_DELTA=0.8333333333333334": 313,
      "TIME_DELTA=0.22916666666666696": 314,
      "TIME_DELTA=0.010416666666666519": 315,
      "TIME_DELTA=0.17708333333333304": 316,
      "TIME_DELTA=0.49166666666666664": 317,
      "NOTE_OFF=97": 318,
      "NOTE_ON=97": 319,
      "TIME_DELTA=0.4895833333333339": 320,
      "TIME_DELTA=0.5104166666666661": 321,
      "TIME_DELTA=0.5416666666666661": 322,
      "TIME_DELTA=0.9375": 323,
      "TIME_DELTA=0.04166666666666652": 324,
      "NOTE_OFF=30": 325,
      "NOTE_ON=30": 326,
      "TIME_DELTA=0.6770833333333334": 327,
      "TIME_DELTA=0.30208333333333304": 328,
      "TIME_DELTA=0.02083333333333348": 329,
      "TIME_DELTA=0.5166666666666667": 330,
      "TIME_DELTA=0.23958333333333304": 331,
      "TIME_DELTA=0.96875": 332,
      "TIME_DELTA=0.32291666666666696": 333,
      "TIME_DELTA=0.525": 334,
      "TIME_DELTA=0.33333333333333304": 335,
      "TIME_DELTA=0.04166666666666785": 336,
      "TIME_DELTA=0.010416666666667851": 337,
      "TIME_DELTA=0.6979166666666666": 338,
      "TIME_DELTA=0.02083333333333215": 339,
      "TIME_DELTA=0.5333333333333333": 340,
      "TIME_DELTA=1.125": 341,
      "NOTE_OFF=96": 342,
      "NOTE_ON=96": 343,
      "TIME_DELTA=0.5208333333333339": 344,
      "TIME_DELTA=0.55": 345,
      "TIME_DELTA=0.5583333333333333": 346,
      "TIME_DELTA=0.7291666666666666": 347,
      "TIME_DELTA=0.35416666666666696": 348,
      "TIME_DELTA=0.5833333333333339": 349,
      "TIME_DELTA=0.5729166666666661": 350,
      "TIME_DELTA=0.5520833333333339": 351,
      "TIME_DELTA=0.5666666666666667": 352,
      "TIME_DELTA=0.05208333333333215": 353,
      "TIME_DELTA=0.575": 354,
      "TIME_DELTA=0.7395833333333334": 355,
      "TIME_DELTA=0.05208333333333348": 356,
      "TIME_DELTA=0.08333333333333215": 357,
      "TIME_DELTA=1.03125": 358,
      "NOTE_OFF=29": 359,
      "NOTE_ON=29": 360,
      "TIME_DELTA=0.9166666666666666": 361,
      "TIME_DELTA=0.07291666666666785": 362,
      "TIME_DELTA=0.08333333333333348": 363,
      "TIME_DELTA=0.5916666666666667": 364,
      "TIME_DELTA=0.7604166666666666": 365,
      "NOTE_OFF=99": 366,
      "NOTE_ON=99": 367,
      "TIME_DELTA=1.0625": 368,
      "TIME_DELTA=0.38541666666666696": 369,
      "TIME_DELTA=0.7708333333333334": 370,
      "TIME_DELTA=0.6166666666666667": 371,
      "TIME_DELTA=0.6041666666666661": 372,
      "TIME_DELTA=0.033333333333333215": 373,
      "TIME_DELTA=0.07291666666666652": 374,
      "TIME_DELTA=0.10416666666666785": 375,
      "TIME_DELTA=0.41666666666666696": 376,
      "TIME_DELTA=0.6": 377,
      "TIME_DELTA=0.36458333333333304": 378,
      "TIME_DELTA=0.6333333333333333": 379,
      "TIME_DELTA=0.6083333333333333": 380,
      "TIME_DELTA=0.16666666666666785": 381,
      "TIME_DELTA=0.13541666666666785": 382,
      "TIME_DELTA=1.09375": 383,
      "TIME_DELTA=0.9583333333333334": 384,
      "TIME_DELTA=1.25": 385,
      "TIME_DELTA=0.11458333333333215": 386,
      "TIME_DELTA=0.6145833333333339": 387,
      "TIME_DELTA=0.8020833333333334": 388,
      "TIME_DELTA=0.6354166666666661": 389,
      "TIME_DELTA=0.6666666666666661": 390,
      "TIME_DELTA=0.14583333333333215": 391,
      "TIME_DELTA=0.6416666666666667": 392,
      "TIME_DELTA=0.10416666666666652": 393,
      "TIME_DELTA=0.29166666666666785": 394,
      "TIME_DELTA=0.26041666666666785": 395,
      "NOTE_OFF=98": 396,
      "NOTE_ON=98": 397,
      "TIME_DELTA=0.6458333333333339": 398,
      "TIME_DELTA=0.8229166666666666": 399,
      "TIME_DELTA=0.39583333333333304": 400,
      "TIME_DELTA=0.65": 401,
      "TIME_DELTA=0.19791666666666785": 402,
      "TIME_DELTA=0.6583333333333333": 403,
      "TIME_DELTA=0.20833333333333215": 404,
      "TIME_DELTA=1.15625": 405,
      "TIME_DELTA=0.17708333333333215": 406,
      "DENSITY=4": 407,
      "TIME_DELTA=0.16666666666666652": 408,
      "DENSITY=3": 409,
      "DENSITY=1": 410,
      "DENSITY=2": 411,
      "TIME_DELTA=0.8541666666666666": 412,
      "TIME_DELTA=0.11458333333333348": 413,
      "TIME_DELTA=0.44791666666666696": 414,
      "TIME_DELTA=0.7083333333333339": 415,
      "DENSITY=0": 416,
      "TIME_DELTA=0.22916666666666785": 417,
      "TIME_DELTA=0.675": 418,
      "TIME_DELTA=1.0416666666666667": 419,
      "TIME_DELTA=0.13541666666666652": 420,
      "TIME_DELTA=0.6770833333333339": 421,
      "TIME_DELTA=0.27083333333333215": 422,
      "TIME_DELTA=0.2916666666666665": 423,
      "TIME_DELTA=0.42708333333333304": 424,
      "TIME_DELTA=0.6833333333333333": 425,
      "TIME_DELTA=0.45833333333333304": 426,
      "TIME_DELTA=0.6916666666666667": 427,
      "TIME_DELTA=0.8645833333333334": 428,
      "TIME_DELTA=1.1875": 429,
      "TIME_DELTA=0.6979166666666661": 430,
      "TIME_DELTA=0.7": 431,
      "TIME_DELTA=0.2604166666666665": 432,
      "TIME_DELTA=0.23958333333333215": 433,
      "TIME_DELTA=1.0833333333333333": 434,
      "TIME_DELTA=0.32291666666666785": 435,
      "TIME_DELTA=0.14583333333333348": 436,
      "TIME_DELTA=1.375": 437,
      "TIME_DELTA=0.30208333333333215": 438,
      "TIME_DELTA=0.8854166666666666": 439,
      "TIME_DELTA=1.21875": 440,
      "TIME_DELTA=0.20833333333333348": 441,
      "TIME_DELTA=0.47916666666666696": 442,
      "NOTE_OFF=100": 443,
      "NOTE_ON=100": 444,
      "TIME_DELTA=0.7291666666666661": 445,
      "TIME_DELTA=0.8958333333333334": 446,
      "TIME_DELTA=0.7395833333333339": 447,
      "TIME_DELTA=0.33333333333333215": 448,
      "TIME_DELTA=0.2708333333333335": 449,
      "TIME_DELTA=0.7166666666666667": 450,
      "TIME_DELTA=0.17708333333333348": 451,
      "TIME_DELTA=0.725": 452,
      "TIME_DELTA=0.04166666666666674": 453,
      "TIME_DELTA=0.19791666666666652": 454,
      "TIME_DELTA=0.09166666666666679": 455,
      "TIME_DELTA=0.01041666666666674": 456,
      "TIME_DELTA=0.22916666666666652": 457,
      "TIME_DELTA=0.7333333333333333": 458,
      "TIME_DELTA=0.7416666666666667": 459,
      "TIME_DELTA=0.541666666666667": 460,
      "TIME_DELTA=0.9270833333333334": 461,
      "TIME_DELTA=0.510416666666667": 462,
      "TIME_DELTA=0.7916666666666661": 463,
      "TIME_DELTA=0.7583333333333333": 464,
      "TIME_DELTA=0.7604166666666661": 465,
      "TIME_DELTA=1.28125": 466,
      "TIME_DELTA=0.35416666666666785": 467,
      "TIME_DELTA=0.02083333333333326": 468,
      "TIME_DELTA=0.48958333333333304": 469,
      "TIME_DELTA=0.3333333333333335": 470,
      "TIME_DELTA=0.7708333333333339": 471,
      "TIME_DELTA=1.5": 472,
      "TIME_DELTA=0.3020833333333335": 473,
      "TIME_DELTA=0.23958333333333348": 474,
      "TIME_DELTA=1.3125": 475,
      "TIME_DELTA=0.05833333333333357": 476,
      "TIME_DELTA=0.3229166666666665": 477,
      "TIME_DELTA=0.520833333333333": 478,
      "TIME_DELTA=0.8333333333333339": 479,
      "TIME_DELTA=0.8020833333333339": 480,
      "TIME_DELTA=1.1666666666666667": 481,
      "TIME_DELTA=0.7666666666666667": 482,
      "TIME_DELTA=0.38541666666666785": 483,
      "TIME_DELTA=0.9479166666666666": 484,
      "TIME_DELTA=0.41666666666666785": 485,
      "TIME_DELTA=0.775": 486,
      "TIME_DELTA=1.2083333333333333": 487,
      "TIME_DELTA=1.34375": 488,
      "TIME_DELTA=0.8229166666666661": 489,
      "TIME_DELTA=1.0208333333333333": 490,
      "TIME_DELTA=0.36458333333333215": 491,
      "TIME_DELTA=0.7833333333333333": 492,
      "TIME_DELTA=0.9895833333333334": 493,
      "TIME_DELTA=0.9791666666666666": 494,
      "TIME_DELTA=0.06666666666666643": 495,
      "TIME_DELTA=0.3541666666666665": 496,
      "TIME_DELTA=1.0104166666666667": 497,
      "TIME_DELTA=0.552083333333333": 498,
      "TIME_DELTA=0.583333333333333": 499,
      "TIME_DELTA=1.625": 500,
      "TIME_DELTA=1.40625": 501,
      "TIME_DELTA=0.8": 502,
      "TIME_DELTA=0.8166666666666667": 503,
      "TIME_DELTA=0.08333333333333326": 504,
      "TIME_DELTA=0.05208333333333326": 505,
      "TIME_DELTA=0.8083333333333333": 506,
      "TIME_DELTA=0.572916666666667": 507,
      "TIME_DELTA=1.0520833333333333": 508,
      "TIME_DELTA=0.39583333333333215": 509,
      "TIME_DELTA=0.8541666666666661": 510,
      "TIME_DELTA=0.4166666666666665": 511,
      "TIME_DELTA=1.4375": 512,
      "TIME_DELTA=0.07291666666666674": 513,
      "TIME_DELTA=0.3854166666666665": 514,
      "TIME_DELTA=1.46875": 515,
      "TIME_DELTA=0.604166666666667": 516,
      "TIME_DELTA=0.15833333333333321": 517,
      "TIME_DELTA=0.025000000000000355": 518,
      "TIME_DELTA=0.8645833333333339": 519,
      "TIME_DELTA=0.825": 520,
      "TIME_DELTA=0.8958333333333339": 521,
      "TIME_DELTA=0.44791666666666785": 522,
      "TIME_DELTA=1.0729166666666667": 523,
      "TIME_DELTA=0.3645833333333335": 524,
      "TIME_DELTA=0.8854166666666661": 525,
      "TIME_DELTA=0.42708333333333215": 526,
      "TIME_DELTA=0.9166666666666661": 527,
      "TIME_DELTA=0.2833333333333332": 528,
      "TIME_DELTA=0.666666666666667": 529,
      "TIME_DELTA=0.21666666666666679": 530,
      "TIME_DELTA=0.8666666666666667": 531,
      "NOTE_OFF=28": 532,
      "NOTE_ON=28": 533,
      "TIME_DELTA=0.85": 534,
      "TIME_DELTA=0.8416666666666667": 535,
      "TIME_DELTA=1.1145833333333333": 536,
      "TIME_DELTA=0.635416666666667": 537,
      "TIME_DELTA=1.2916666666666667": 538,
      "TIME_DELTA=0.614583333333333": 539,
      "TIME_DELTA=1.53125": 540,
      "TIME_DELTA=0.45833333333333215": 541,
      "TIME_DELTA=1.1041666666666667": 542,
      "TIME_DELTA=0.10416666666666674": 543,
      "TIME_DELTA=1.75": 544,
      "TIME_DELTA=1.3333333333333333": 545,
      "TIME_DELTA=1.5625": 546,
      "TIME_DELTA=0.47916666666666785": 547,
      "TIME_DELTA=0.29166666666666674": 548,
      "TIME_DELTA=0.9583333333333339": 549,
      "TIME_DELTA=0.8583333333333333": 550,
      "TIME_DELTA=0.9270833333333339": 551,
      "TIME_DELTA=0.016666666666666607": 552,
      "TIME_DELTA=0.3958333333333335": 553,
      "TIME_DELTA=0.18333333333333357": 554,
      "TIME_DELTA=0.645833333333333": 555,
      "TIME_DELTA=0.8833333333333333": 556,
      "TIME_DELTA=0.708333333333333": 557,
      "TIME_DELTA=0.16666666666666674": 558,
      "TIME_DELTA=1.59375": 559,
      "TIME_DELTA=1.1458333333333333": 560,
      "TIME_DELTA=0.26041666666666674": 561,
      "TIME_DELTA=1.1354166666666667": 562,
      "TIME_DELTA=0.11458333333333326": 563,
      "NOTE_OFF=101": 564,
      "NOTE_ON=101": 565,
      "TIME_DELTA=0.13541666666666674": 566,
      "TIME_DELTA=0.09999999999999964": 567,
      "TIME_DELTA=0.15000000000000036": 568,
      "TIME_DELTA=0.8916666666666667": 569,
      "TIME_DELTA=0.4479166666666665": 570,
      "TIME_DELTA=0.9083333333333333": 571,
      "TIME_DELTA=0.9479166666666661": 572,
      "TIME_DELTA=0.677083333333333": 573,
      "TIME_DELTA=1.65625": 574,
      "TIME_DELTA=0.9": 575,
      "TIME_DELTA=1.1770833333333333": 576,
      "TIME_DELTA=0.3416666666666668": 577,
      "TIME_DELTA=0.4583333333333335": 578,
      "TIME_DELTA=0.00833333333333286": 579,
      "TIME_DELTA=0.48958333333333215": 580,
      "TIME_DELTA=0.07499999999999929": 581,
      "TIME_DELTA=0.9895833333333339": 582,
      "TIME_DELTA=0.5416666666666679": 583,
      "TIME_DELTA=0.19166666666666643": 584,
      "TIME_DELTA=0.20833333333333326": 585,
      "NOTE_OFF=27": 586,
      "NOTE_ON=27": 587,
      "TIME_DELTA=0.31666666666666643": 588,
      "TIME_DELTA=0.4270833333333335": 589,
      "TIME_DELTA=0.27083333333333326": 590,
      "TIME_DELTA=0.5104166666666679": 591,
      "TIME_DELTA=0.697916666666667": 592,
      "TIME_DELTA=0.925": 593,
      "TIME_DELTA=0.14583333333333326": 594,
      "TIME_DELTA=0.30833333333333357": 595,
      "TIME_DELTA=0.9416666666666667": 596,
      "TIME_DELTA=0.9333333333333333": 597,
      "TIME_DELTA=0.5416666666666665": 598,
      "TIME_DELTA=1.6875": 599,
      "TIME_DELTA=0.27500000000000036": 600,
      "TIME_DELTA=0.4791666666666665": 601,
      "TIME_DELTA=1.4166666666666667": 602,
      "TIME_DELTA=0.9791666666666661": 603,
      "TIME_DELTA=0.739583333333333": 604,
      "TIME_DELTA=1.4583333333333333": 605,
      "TIME_DELTA=0.04166666666666663": 606,
      "TIME_DELTA=0.10833333333333339": 607,
      "TIME_DELTA=1.875": 608,
      "TIME_DELTA=0.95": 609,
      "TIME_DELTA=0.729166666666667": 610,
      "TIME_DELTA=1.71875": 611,
      "TIME_DELTA=0.01041666666666663": 612,
      "TIME_DELTA=0.33333333333333326": 613,
      "TIME_DELTA=1.041666666666666": 614,
      "TIME_DELTA=1.1979166666666667": 615,
      "TIME_DELTA=0.5104166666666665": 616,
      "TIME_DELTA=1.2395833333333333": 617,
      "TIME_DELTA=1.020833333333334": 618,
      "TIME_DELTA=0.19791666666666674": 619,
      "TIME_DELTA=0.22499999999999964": 620,
      "TIME_DELTA=1.010416666666666": 621,
      "TIME_DELTA=0.791666666666667": 622,
      "TIME_DELTA=0.32291666666666674": 623,
      "TIME_DELTA=0.5208333333333321": 624,
      "TIME_DELTA=0.30208333333333326": 625,
      "TIME_DELTA=0.22916666666666674": 626,
      "TIME_DELTA=0.02083333333333337": 627,
      "TIME_DELTA=0.17708333333333326": 628,
      "TIME_DELTA=1.2708333333333333": 629,
      "TIME_DELTA=0.9666666666666667": 630,
      "TIME_DELTA=0.9916666666666667": 631,
      "TIME_DELTA=0.07500000000000018": 632,
      "TIME_DELTA=0.13333333333333286": 633,
      "TIME_DELTA=1.083333333333334": 634,
      "TIME_DELTA=0.4895833333333335": 635,
      "TIME_DELTA=1.0166666666666666": 636,
      "TIME_DELTA=0.5520833333333321": 637,
      "TIME_DELTA=0.11666666666666714": 638,
      "TIME_DELTA=0.016666666666667496": 639,
      "TIME_DELTA=0.770833333333333": 640,
      "TIME_DELTA=1.052083333333334": 641,
      "TIME_DELTA=0.5208333333333335": 642,
      "TIME_DELTA=0.5729166666666679": 643,
      "TIME_DELTA=1.0083333333333333": 644,
      "TIME_DELTA=0.760416666666667": 645,
      "TIME_DELTA=1.2291666666666667": 646,
      "TIME_DELTA=1.78125": 647,
      "TIME_DELTA=0.975": 648,
      "TIME_DELTA=0.5833333333333321": 649,
      "TIME_DELTA=2.0": 650,
      "TIME_DELTA=0.9833333333333333": 651,
      "TIME_DELTA=0.5833333333333335": 652,
      "TIME_DELTA=1.2604166666666667": 653,
      "TIME_DELTA=0.23958333333333326": 654,
      "TIME_DELTA=0.05000000000000071": 655,
      "TIME_DELTA=1.3020833333333333": 656,
      "TIME_DELTA=1.5416666666666667": 657,
      "TIME_DELTA=0.4083333333333332": 658,
      "TIME_DELTA=0.833333333333333": 659,
      "TIME_DELTA=0.35416666666666674": 660,
      "TIME_DELTA=0.802083333333333": 661,
      "TIME_DELTA=1.5833333333333333": 662,
      "TIME_DELTA=0.1416666666666666": 663,
      "TIME_DELTA=1.8125": 664,
      "TIME_DELTA=0.5520833333333335": 665,
      "TIME_DELTA=0.41666666666666674": 666,
      "TIME_DELTA=1.072916666666666": 667,
      "TIME_DELTA=0.6041666666666679": 668,
      "TIME_DELTA=1.025": 669,
      "TIME_DELTA=0.25833333333333286": 670,
      "TIME_DELTA=0.5729166666666665": 671,
      "TIME_DELTA=0.05208333333333337": 672,
      "TIME_DELTA=0.34999999999999964": 673,
      "TIME_DELTA=1.84375": 674,
      "TIME_DELTA=1.0333333333333334": 675,
      "TIME_DELTA=1.3645833333333333": 676,
      "TIME_DELTA=1.05": 677,
      "TIME_DELTA=0.2666666666666666": 678,
      "TIME_DELTA=1.114583333333334": 679,
      "TIME_DELTA=0.38541666666666674": 680,
      "NOTE_OFF=25": 681,
      "NOTE_ON=25": 682,
      "TIME_DELTA=1.3229166666666667": 683,
      "TIME_DELTA=0.08333333333333337": 684,
      "TIME_DELTA=0.6041666666666665": 685,
      "NOTE_OFF=26": 686,
      "NOTE_ON=26": 687,
      "TIME_DELTA=0.822916666666667": 688,
      "TIME_DELTA=1.104166666666666": 689,
      "TIME_DELTA=0.36458333333333326": 690,
      "TIME_DELTA=1.145833333333334": 691,
      "TIME_DELTA=1.0583333333333333": 692,
      "TIME_DELTA=1.3958333333333333": 693,
      "TIME_DELTA=1.1083333333333334": 694,
      "TIME_DELTA=1.3541666666666667": 695,
      "TIME_DELTA=1.135416666666666": 696,
      "TIME_DELTA=1.6666666666666667": 697,
      "TIME_DELTA=1.90625": 698,
      "TIME_DELTA=0.1083333333333325": 699,
      "TIME_DELTA=0.6145833333333321": 700,
      "TIME_DELTA=0.854166666666667": 701,
      "TIME_DELTA=0.864583333333333": 702,
      "TIME_DELTA=0.6666666666666679": 703,
      "TIME_DELTA=1.166666666666666": 704,
      "TIME_DELTA=0.24166666666666714": 705,
      "TIME_DELTA=2.125": 706,
      "TIME_DELTA=1.177083333333334": 707,
      "TIME_DELTA=1.4270833333333333": 708,
      "TIME_DELTA=0.04999999999999982": 709,
      "TIME_DELTA=0.4666666666666668": 710,
      "TIME_DELTA=0.6354166666666679": 711,
      "TIME_DELTA=0.6666666666666665": 712,
      "TIME_DELTA=1.208333333333334": 713,
      "TIME_DELTA=0.6145833333333335": 714,
      "TIME_DELTA=1.1": 715,
      "TIME_DELTA=0.2333333333333334": 716,
      "TIME_DELTA=1.0666666666666667": 717,
      "TIME_DELTA=0.07291666666666663": 718,
      "TIME_DELTA=1.0916666666666666": 719,
      "TIME_DELTA=0.6354166666666665": 720,
      "TIME_DELTA=1.7083333333333333": 721,
      "TIME_DELTA=1.3854166666666667": 722,
      "TIME_DELTA=1.1166666666666667": 723,
      "TIME_DELTA=0.6458333333333321": 724,
      "TIME_DELTA=1.075": 725,
      "TIME_DELTA=0.43333333333333357": 726,
      "TIME_DELTA=0.008333333333333304": 727,
      "TIME_DELTA=1.9375": 728,
      "TIME_DELTA=0.916666666666667": 729,
      "TIME_DELTA=0.885416666666667": 730,
      "TIME_DELTA=1.1416666666666666": 731,
      "TIME_DELTA=0.39583333333333326": 732,
      "TIME_DELTA=0.29166666666666663": 733,
      "TIME_DELTA=1.1333333333333333": 734,
      "TIME_DELTA=0.895833333333333": 735,
      "TIME_DELTA=0.44166666666666643": 736,
      "TIME_DELTA=2.25": 737,
      "TIME_DELTA=1.7763568394002505e-15": 738,
      "TIME_DELTA=1.96875": 739,
      "TIME_DELTA=0.10416666666666663": 740,
      "TIME_DELTA=0.45833333333333326": 741,
      "TIME_DELTA=2.0625": 742,
      "TIME_DELTA=0.6458333333333335": 743,
      "TIME_DELTA=1.7916666666666667": 744,
      "TIME_DELTA=1.15": 745,
      "TIME_DELTA=0.16666666666666663": 746,
      "TIME_DELTA=0.958333333333333": 747,
      "TIME_DELTA=2.03125": 748,
      "TIME_DELTA=0.40000000000000036": 749,
      "TIME_DELTA=1.239583333333334": 750,
      "TIME_DELTA=0.7083333333333335": 751,
      "TIME_DELTA=0.6770833333333321": 752,
      "TIME_DELTA=1.4895833333333333": 753,
      "TIME_DELTA=0.6770833333333335": 754,
      "TIME_DELTA=0.7083333333333321": 755,
      "TIME_DELTA=0.5333333333333332": 756,
      "TIME_DELTA=1.4479166666666667": 757,
      "TIME_DELTA=0.6979166666666679": 758,
      "TIME_DELTA=1.8333333333333333": 759,
      "TIME_DELTA=0.1416666666666675": 760,
      "TIME_DELTA=0.6979166666666665": 761,
      "TIME_DELTA=1.197916666666666": 762,
      "TIME_DELTA=0.1750000000000007": 763,
      "TIME_DELTA=0.1999999999999993": 764,
      "TIME_DELTA=0.26041666666666663": 765,
      "TIME_DELTA=1.270833333333334": 766,
      "TIME_DELTA=1.1583333333333334": 767,
      "TIME_DELTA=0.927083333333333": 768,
      "TIME_DELTA=0.42708333333333326": 769,
      "TIME_DELTA=0.44791666666666674": 770,
      "TIME_DELTA=1.5208333333333333": 771,
      "TIME_DELTA=1.5104166666666667": 772,
      "TIME_DELTA=0.11458333333333337": 773,
      "TIME_DELTA=0.20833333333333337": 774,
      "TIME_DELTA=1.4791666666666667": 775,
      "TIME_DELTA=0.2583333333333333": 776,
      "TIME_DELTA=0.36666666666666714": 777,
      "TIME_DELTA=1.1833333333333333": 778,
      "TIME_DELTA=1.1916666666666667": 779,
      "TIME_DELTA=1.5520833333333333": 780,
      "TIME_DELTA=0.3583333333333334": 781,
      "TIME_DELTA=1.229166666666666": 782,
      "NOTE_OFF=102": 783,
      "NOTE_ON=102": 784,
      "TIME_DELTA=2.09375": 785,
      "TIME_DELTA=0.20000000000000018": 786,
      "TIME_DELTA=0.13541666666666663": 787,
      "TIME_DELTA=0.2666666666666675": 788,
      "TIME_DELTA=0.947916666666667": 789,
      "TIME_DELTA=1.175": 790,
      "TIME_DELTA=1.291666666666666": 791,
      "TIME_DELTA=0.1333333333333333": 792,
      "TIME_DELTA=0.3000000000000007": 793,
      "TIME_DELTA=1.302083333333334": 794,
      "TIME_DELTA=0.1166666666666667": 795,
      "TIME_DELTA=0.47916666666666674": 796,
      "TIME_DELTA=1.260416666666666": 797,
      "TIME_DELTA=1.333333333333334": 798,
      "TIME_DELTA=1.2333333333333334": 799,
      "TIME_DELTA=0.7395833333333335": 800,
      "TIME_DELTA=1.225": 801,
      "TIME_DELTA=8.881784197001252e-16": 802,
      "TIME_DELTA=1.9166666666666667": 803,
      "TIME_DELTA=0.7291666666666665": 804,
      "TIME_DELTA=0.041666666666666685": 805,
      "TIME_DELTA=0.7395833333333321": 806,
      "TIME_DELTA=0.3249999999999993": 807,
      "TIME_DELTA=2.15625": 808,
      "TIME_DELTA=0.38333333333333286": 809,
      "TIME_DELTA=0.979166666666667": 810,
      "TIME_DELTA=0.17499999999999982": 811,
      "TIME_DELTA=1.020833333333333": 812,
      "TIME_DELTA=0.7291666666666679": 813,
      "TIME_DELTA=0.19791666666666663": 814,
      "TIME_DELTA=0.22916666666666663": 815,
      "TIME_DELTA=1.5729166666666667": 816,
      "TIME_DELTA=0.14583333333333337": 817,
      "TIME_DELTA=0.7604166666666679": 818,
      "TIME_DELTA=2.0416666666666665": 819,
      "TIME_DELTA=0.7916666666666665": 820,
      "TIME_DELTA=1.2666666666666666": 821,
      "TIME_DELTA=1.2166666666666666": 822,
      "TIME_DELTA=0.7604166666666665": 823,
      "TIME_DELTA=0.3916666666666666": 824,
      "TIME_DELTA=0.7916666666666679": 825,
      "TIME_DELTA=1.2": 826,
      "TIME_DELTA=1.6041666666666667": 827,
      "TIME_DELTA=0.5416666666666667": 828,
      "TIME_DELTA=0.2333333333333325": 829,
      "TIME_DELTA=0.010416666666666685": 830,
      "TIME_DELTA=0.5916666666666668": 831,
      "TIME_DELTA=2.375": 832,
      "TIME_DELTA=0.989583333333333": 833,
      "TIME_DELTA=1.2583333333333333": 834,
      "TIME_DELTA=16.0": 835,
      "TIME_DELTA=1.010416666666667": 836,
      "TIME_DELTA=1.322916666666666": 837,
      "TIME_DELTA=1.6145833333333333": 838,
      "TIME_DELTA=1.041666666666667": 839,
      "TIME_DELTA=1.2416666666666667": 840,
      "TIME_DELTA=0.2999999999999998": 841,
      "TIME_DELTA=0.47499999999999964": 842,
      "TIME_DELTA=0.27083333333333337": 843,
      "TIME_DELTA=0.17708333333333337": 844,
      "TIME_DELTA=2.21875": 845,
      "NOTE_OFF=24": 846,
      "NOTE_ON=24": 847,
      "TIME_DELTA=0.7708333333333335": 848,
      "TIME_DELTA=1.052083333333333": 849,
      "TIME_DELTA=0.8333333333333335": 850,
      "TIME_DELTA=0.48958333333333326": 851,
      "TIME_DELTA=1.083333333333333": 852,
      "TIME_DELTA=2.1875": 853,
      "TIME_DELTA=0.33333333333333337": 854,
      "TIME_DELTA=1.275": 855,
      "TIME_DELTA=0.5104166666666667": 856,
      "TIME_DELTA=1.9583333333333333": 857,
      "TIME_DELTA=1.364583333333334": 858,
      "TIME_DELTA=2.0833333333333335": 859,
      "TIME_DELTA=1.6354166666666667": 860,
      "TIME_DELTA=0.7708333333333321": 861,
      "TIME_DELTA=0.05833333333333335": 862,
      "TIME_DELTA=1.416666666666666": 863,
      "TIME_DELTA=1.6458333333333333": 864,
      "TIME_DELTA=0.020833333333333315": 865,
      "TIME_DELTA=0.23958333333333337": 866,
      "TIME_DELTA=0.3250000000000002": 867,
      "TIME_DELTA=0.8020833333333335": 868,
      "TIME_DELTA=2.1666666666666665": 869,
      "TIME_DELTA=1.354166666666666": 870,
      "TIME_DELTA=1.3583333333333334": 871,
      "TIME_DELTA=1.458333333333334": 872,
      "TIME_DELTA=1.6770833333333333": 873,
      "TIME_DELTA=1.2833333333333334": 874,
      "TIME_DELTA=2.5": 875,
      "TIME_DELTA=0.2416666666666667": 876,
      "TIME_DELTA=0.5583333333333336": 877,
      "TIME_DELTA=0.8229166666666679": 878,
      "TIME_DELTA=1.3": 879,
      "TIME_DELTA=0.32291666666666663": 880,
      "TIME_DELTA=1.072916666666667": 881,
      "TIME_DELTA=2.28125": 882,
      "TIME_DELTA=0.8333333333333321": 883,
      "TIME_DELTA=0.30208333333333337": 884,
      "TIME_DELTA=1.385416666666666": 885,
      "TIME_DELTA=0.02499999999999991": 886,
      "TIME_DELTA=1.395833333333334": 887,
      "TIME_DELTA=0.8020833333333321": 888,
      "TIME_DELTA=0.08333333333333331": 889,
      "TIME_DELTA=0.5833333333333333": 890,
      "TIME_DELTA=0.5208333333333333": 891,
      "TIME_DELTA=1.6979166666666667": 892,
      "TIME_DELTA=0.16666666666666669": 893,
      "TIME_DELTA=0.5666666666666664": 894,
      "TIME_DELTA=0.008333333333333748": 895,
      "TIME_DELTA=2.3125": 896,
      "TIME_DELTA=1.3083333333333333": 897,
      "TIME_DELTA=0.033333333333333326": 898,
      "TIME_DELTA=0.5250000000000004": 899,
      "TIME_DELTA=1.7395833333333333": 900,
      "TIME_DELTA=1.325": 901,
      "TIME_DELTA=0.06666666666666665": 902,
      "TIME_DELTA=0.8229166666666665": 903,
      "TIME_DELTA=1.427083333333334": 904,
      "TIME_DELTA=0.031249999999998224": 905,
      "TIME_DELTA=2.34375": 906,
      "TIME_DELTA=1.7291666666666667": 907,
      "TIME_DELTA=0.6583333333333332": 908,
      "TIME_DELTA=1.3916666666666666": 909,
      "TIME_DELTA=0.35416666666666663": 910,
      "TIME_DELTA=0.41666666666666663": 911,
      "TIME_DELTA=1.3166666666666667": 912,
      "TIME_DELTA=1.7604166666666667": 913,
      "TIME_DELTA=0.3583333333333325": 914,
      "TIME_DELTA=1.35": 915,
      "TIME_DELTA=2.2083333333333335": 916,
      "TIME_DELTA=1.114583333333333": 917,
      "TIME_DELTA=1.104166666666667": 918,
      "TIME_DELTA=1.489583333333334": 919,
      "TIME_DELTA=1.7708333333333333": 920,
      "TIME_DELTA=2.40625": 921,
      "TIME_DELTA=0.8541666666666679": 922,
      "TIME_DELTA=1.447916666666666": 923,
      "TIME_DELTA=0.052083333333333315": 924,
      "TIME_DELTA=1.166666666666667": 925,
      "TIME_DELTA=1.8229166666666667": 926,
      "TIME_DELTA=0.4833333333333334": 927,
      "TIME_DELTA=0.8645833333333335": 928,
      "TIME_DELTA=0.5520833333333333": 929,
      "TIME_DELTA=1.3666666666666667": 930,
      "TIME_DELTA=0.1499999999999999": 931,
      "TIME_DELTA=1.3416666666666666": 932,
      "TIME_DELTA=1.8020833333333333": 933,
      "TIME_DELTA=0.8541666666666665": 934,
      "TIME_DELTA=1.3833333333333333": 935,
      "TIME_DELTA=0.031250000000001776": 936,
      "TIME_DELTA=1.145833333333333": 937,
      "TIME_DELTA=1.135416666666667": 938,
      "TIME_DELTA=1.479166666666666": 939,
      "TIME_DELTA=1.541666666666666": 940,
      "TIME_DELTA=1.208333333333333": 941,
      "TIME_DELTA=1.4083333333333334": 942,
      "TIME_DELTA=0.10000000000000009": 943,
      "TIME_DELTA=2.4375": 944,
      "TIME_DELTA=0.6041666666666667": 945,
      "TIME_DELTA=2.625": 946,
      "TIME_DELTA=0.13541666666666669": 947,
      "TIME_DELTA=0.07499999999999996": 948,
      "TIME_DELTA=0.4250000000000007": 949,
      "TIME_DELTA=2.0104166666666665": 950,
      "TIME_DELTA=1.4": 951,
      "TIME_DELTA=0.5729166666666667": 952,
      "TIME_DELTA=1.177083333333333": 953,
      "TIME_DELTA=1.583333333333334": 954,
      "TIME_DELTA=0.07291666666666669": 955,
      "TIME_DELTA=0.8854166666666679": 956,
      "TIME_DELTA=0.38541666666666663": 957,
      "TIME_DELTA=1.8541666666666667": 958,
      "TIME_DELTA=0.5166666666666666": 959,
      "TIME_DELTA=0.9166666666666679": 960,
      "TIME_DELTA=0.5083333333333329": 961,
      "TIME_DELTA=2.2916666666666665": 962,
      "TIME_DELTA=0.031249999999999112": 963,
      "TIME_DELTA=0.9583333333333335": 964,
      "TIME_DELTA=0.20833333333333331": 965,
      "TIME_DELTA=0.8645833333333321": 966,
      "TIME_DELTA=0.8958333333333321": 967,
      "TIME_DELTA=1.520833333333334": 968,
      "TIME_DELTA=4.440892098500626e-16": 969,
      "TIME_DELTA=1.425": 970,
      "TIME_DELTA=0.6666666666666667": 971,
      "TIME_DELTA=1.8958333333333333": 972,
      "TIME_DELTA=1.4833333333333334": 973,
      "TIME_DELTA=1.4916666666666667": 974,
      "TIME_DELTA=0.7166666666666668": 975,
      "TIME_DELTA=0.49166666666666714": 976,
      "TIME_DELTA=1.8854166666666667": 977,
      "TIME_DELTA=0.8854166666666665": 978,
      "TIME_DELTA=1.45": 979,
      "TIME_DELTA=0.14583333333333331": 980,
      "TIME_DELTA=0.5999999999999996": 981,
      "TIME_DELTA=1.510416666666666": 982,
      "TIME_DELTA=1.239583333333333": 983,
      "TIME_DELTA=1.8645833333333333": 984,
      "TIME_DELTA=1.4333333333333333": 985,
      "TIME_DELTA=2.3333333333333335": 986,
      "TIME_DELTA=0.36458333333333337": 987,
      "TIME_DELTA=1.552083333333334": 988,
      "TIME_DELTA=0.3666666666666667": 989,
      "TIME_DELTA=0.062499999999998224": 990,
      "TIME_DELTA=0.10416666666666669": 991,
      "TIME_DELTA=0.6145833333333333": 992,
      "TIME_DELTA=0.7083333333333333": 993,
      "TIME_DELTA=0.9166666666666665": 994,
      "TIME_DELTA=0.2749999999999999": 995,
      "NOTE_OFF=103": 996,
      "NOTE_ON=103": 997,
      "TIME_DELTA=1.475": 998,
      "TIME_DELTA=0.06250000000000178": 999,
      "TIME_DELTA=1.5166666666666666": 1000,
      "TIME_DELTA=0.13333333333333375": 1001,
      "TIME_DELTA=2.0729166666666665": 1002,
      "TIME_DELTA=0.9270833333333321": 1003,
      "TIME_DELTA=2.75": 1004,
      "TIME_DELTA=0.8958333333333335": 1005,
      "TIME_DELTA=0.18333333333333335": 1006,
      "TIME_DELTA=0.9583333333333321": 1007,
      "TIME_DELTA=1.9479166666666667": 1008,
      "TIME_DELTA=2.46875": 1009,
      "TIME_DELTA=0.6354166666666667": 1010,
      "TIME_DELTA=1.197916666666667": 1011,
      "TIME_DELTA=0.3833333333333333": 1012,
      "TIME_DELTA=0.03125000000000089": 1013,
      "TIME_DELTA=1.291666666666667": 1014,
      "TIME_DELTA=2.0208333333333335": 1015,
      "TIME_DELTA=1.9270833333333333": 1016,
      "TIME_DELTA=1.4666666666666666": 1017,
      "TIME_DELTA=0.4499999999999993": 1018,
      "TIME_DELTA=1.333333333333333": 1019,
      "TIME_DELTA=1.4416666666666667": 1020,
      "TIME_DELTA=1.604166666666666": 1021,
      "TIME_DELTA=2.1354166666666665": 1022,
      "TIME_DELTA=2.53125": 1023,
      "TIME_DELTA=0.6458333333333333": 1024,
      "TIME_DELTA=1.572916666666666": 1025,
      "TIME_DELTA=0.11666666666666625": 1026,
      "TIME_DELTA=0.3916666666666675": 1027,
      "TIME_DELTA=2.1041666666666665": 1028,
      "TIME_DELTA=1.614583333333334": 1029,
      "TIME_DELTA=1.9791666666666667": 1030,
      "TIME_DELTA=1.5083333333333333": 1031,
      "TIME_DELTA=0.4249999999999998": 1032,
      "TIME_DELTA=0.39583333333333337": 1033,
      "TIME_DELTA=0.6770833333333333": 1034,
      "TIME_DELTA=0.01666666666666572": 1035,
      "TIME_DELTA=0.12499999999999822": 1036,
      "TIME_DELTA=0.9270833333333335": 1037,
      "TIME_DELTA=0.6916666666666664": 1038,
      "TIME_DELTA=2.5625": 1039,
      "TIME_DELTA=1.525": 1040,
      "TIME_DELTA=0.06249999999999911": 1041,
      "TIME_DELTA=1.666666666666666": 1042,
      "TIME_DELTA=2.0520833333333335": 1043,
      "TIME_DELTA=0.06250000000000089": 1044,
      "TIME_DELTA=0.19791666666666669": 1045,
      "TIME_DELTA=1.302083333333333": 1046,
      "TIME_DELTA=0.9479166666666665": 1047,
      "TIME_DELTA=0.12499999999999911": 1048,
      "TIME_DELTA=0.25833333333333375": 1049,
      "TIME_DELTA=1.645833333333334": 1050,
      "TIME_DELTA=0.2250000000000001": 1051,
      "TIME_DELTA=1.229166666666667": 1052,
      "TIME_DELTA=0.09374999999999822": 1053,
      "TIME_DELTA=0.6500000000000004": 1054,
      "TIME_DELTA=0.12500000000000178": 1055,
      "TIME_DELTA=1.5666666666666667": 1056,
      "TIME_DELTA=1.9895833333333333": 1057,
      "TIME_DELTA=0.9479166666666679": 1058,
      "TIME_DELTA=0.11458333333333331": 1059,
      "TIME_DELTA=1.5583333333333333": 1060,
      "TIME_DELTA=2.4583333333333335": 1061,
      "TIME_DELTA=1.575": 1062,
      "TIME_DELTA=1.260416666666667": 1063,
      "TIME_DELTA=1.270833333333333": 1064,
      "TIME_DELTA=1.635416666666666": 1065,
      "TIME_DELTA=0.17708333333333331": 1066,
      "TIME_DELTA=0.4500000000000002": 1067,
      "TIME_DELTA=0.45833333333333337": 1068,
      "TIME_DELTA=1.0416666666666665": 1069,
      "TIME_DELTA=2.4166666666666665": 1070,
      "TIME_DELTA=0.10833333333333428": 1071,
      "TIME_DELTA=0.09375000000000178": 1072,
      "TIME_DELTA=2.59375": 1073,
      "TIME_DELTA=0.09375000000000089": 1074,
      "TIME_DELTA=1.55": 1075,
      "TIME_DELTA=0.07500000000000107": 1076,
      "TIME_DELTA=0.1250000000000009": 1077,
      "TIME_DELTA=1.6083333333333334": 1078,
      "TIME_DELTA=1.5333333333333334": 1079,
      "TIME_DELTA=0.6979166666666667": 1080,
      "TIME_DELTA=0.7291666666666667": 1081,
      "TIME_DELTA=0.9895833333333321": 1082,
      "TIME_DELTA=1.6166666666666667": 1083,
      "TIME_DELTA=2.875": 1084,
      "TIME_DELTA=0.6833333333333336": 1085,
      "TIME_DELTA=1.708333333333334": 1086,
      "TIME_DELTA=0.09374999999999911": 1087,
      "TIME_DELTA=1.677083333333334": 1088,
      "TIME_DELTA=1.6333333333333333": 1089,
      "TIME_DELTA=0.44791666666666663": 1090,
      "TIME_DELTA=1.791666666666666": 1091,
      "TIME_DELTA=0.9791666666666665": 1092,
      "TIME_DELTA=0.050000000000000044": 1093,
      "TIME_DELTA=1.6": 1094,
      "TIME_DELTA=1.65": 1095,
      "TIME_DELTA=1.6416666666666666": 1096,
      "TIME_DELTA=2.1145833333333335": 1097,
      "TIME_DELTA=0.2812499999999991": 1098,
      "TIME_DELTA=0.6166666666666671": 1099,
      "TIME_DELTA=2.1458333333333335": 1100,
      "TIME_DELTA=0.2812500000000009": 1101,
      "TIME_DELTA=0.6083333333333334": 1102,
      "TIME_DELTA=1.0104166666666679": 1103,
      "TIME_DELTA=1.5916666666666666": 1104,
      "TIME_DELTA=0.7916666666666667": 1105,
      "TIME_DELTA=0.1562499999999991": 1106,
      "TIME_DELTA=1.0104166666666665": 1107,
      "TIME_DELTA=2.5416666666666665": 1108,
      "TIME_DELTA=0.3124999999999991": 1109,
      "TIME_DELTA=0.42708333333333337": 1110,
      "TIME_DELTA=1.0208333333333335": 1111,
      "TIME_DELTA=0.15624999999999822": 1112,
      "TIME_DELTA=0.19166666666666665": 1113,
      "TIME_DELTA=2.1770833333333335": 1114,
      "TIME_DELTA=1.0833333333333335": 1115,
      "TIME_DELTA=0.7833333333333332": 1116,
      "TIME_DELTA=1.7333333333333334": 1117,
      "TIME_DELTA=0.9895833333333335": 1118,
      "TIME_DELTA=1.0416666666666679": 1119,
      "TIME_DELTA=2.1979166666666665": 1120,
      "TIME_DELTA=0.9791666666666679": 1121,
      "TIME_DELTA=1.364583333333333": 1122,
      "TIME_DELTA=0.1562500000000009": 1123,
      "TIME_DELTA=1.322916666666667": 1124,
      "TIME_DELTA=0.4833333333333325": 1125,
      "TIME_DELTA=0.24166666666666625": 1126,
      "TIME_DELTA=0.2499999999999991": 1127,
      "TIME_DELTA=1.739583333333334": 1128,
      "TIME_DELTA=0.08333333333333334": 1129,
      "TIME_DELTA=0.22916666666666669": 1130,
      "TIME_DELTA=2.2604166666666665": 1131,
      "TIME_DELTA=2.65625": 1132,
      "TIME_DELTA=0.3125000000000009": 1133,
      "TIME_DELTA=2.2291666666666665": 1134,
      "TIME_DELTA=2.6875": 1135,
      "TIME_DELTA=1.416666666666667": 1136,
      "TIME_DELTA=1.833333333333334": 1137,
      "TIME_DELTA=1.395833333333333": 1138,
      "TIME_DELTA=0.3437499999999991": 1139,
      "TIME_DELTA=1.0208333333333321": 1140,
      "TIME_DELTA=0.5500000000000007": 1141,
      "TIME_DELTA=1.458333333333333": 1142,
      "TIME_DELTA=1.6583333333333334": 1143,
      "TIME_DELTA=2.71875": 1144,
      "TIME_DELTA=0.09166666666666667": 1145,
      "TIME_DELTA=0.18749999999999822": 1146,
      "TIME_DELTA=1.6833333333333333": 1147,
      "TIME_DELTA=2.2708333333333335": 1148,
      "TIME_DELTA=0.7395833333333333": 1149,
      "TIME_DELTA=1.729166666666666": 1150,
      "TIME_DELTA=0.1874999999999991": 1151,
      "TIME_DELTA=0.1875000000000009": 1152,
      "TIME_DELTA=1.0520833333333321": 1153,
      "TIME_DELTA=0.04166666666666666": 1154,
      "TIME_DELTA=1.760416666666666": 1155,
      "TIME_DELTA=1.725": 1156,
      "TIME_DELTA=0.23958333333333331": 1157,
      "TIME_DELTA=1.675": 1158,
      "TIME_DELTA=2.2395833333333335": 1159,
      "TIME_DELTA=0.2187499999999991": 1160,
      "TIME_DELTA=0.3749999999999991": 1161,
      "TIME_DELTA=0.2500000000000009": 1162,
      "TIME_DELTA=1.697916666666666": 1163,
      "TIME_DELTA=0.14166666666666572": 1164,
      "TIME_DELTA=0.3750000000000009": 1165,
      "TIME_DELTA=0.6333333333333329": 1166,
      "TIME_DELTA=1.0833333333333321": 1167,
      "TIME_DELTA=0.18750000000000178": 1168,
      "TIME_DELTA=1.822916666666666": 1169,
      "TIME_DELTA=0.5166666666666675": 1170,
      "TIME_DELTA=0.6416666666666666": 1171,
      "TIME_DELTA=0.7249999999999996": 1172,
      "TIME_DELTA=1.885416666666666": 1173,
      "TIME_DELTA=3.0": 1174,
      "TIME_DELTA=0.2187500000000009": 1175,
      "TIME_DELTA=0.15625000000000178": 1176,
      "TIME_DELTA=1.7": 1177,
      "TIME_DELTA=0.3500000000000001": 1178,
      "TIME_DELTA=0.7604166666666667": 1179,
      "TIME_DELTA=1.0520833333333335": 1180,
      "TIME_DELTA=0.031249999999999556": 1181,
      "TIME_DELTA=1.6916666666666667": 1182,
      "TIME_DELTA=1.770833333333334": 1183,
      "TIME_DELTA=2.5833333333333335": 1184,
      "TIME_DELTA=0.8416666666666668": 1185,
      "TIME_DELTA=0.058333333333333126": 1186,
      "TIME_DELTA=0.47916666666666663": 1187,
      "TIME_DELTA=1.854166666666666": 1188,
      "TIME_DELTA=0.21874999999999822": 1189,
      "TIME_DELTA=2.3541666666666665": 1190,
      "TIME_DELTA=0.8020833333333333": 1191,
      "TIME_DELTA=0.031250000000000444": 1192,
      "TIME_DELTA=1.427083333333333": 1193,
      "TIME_DELTA=1.7666666666666666": 1194,
      "TIME_DELTA=0.4916666666666667": 1195,
      "TIME_DELTA=1.7416666666666667": 1196,
      "TIME_DELTA=1.802083333333334": 1197,
      "TIME_DELTA=1.916666666666666": 1198,
      "TIME_DELTA=0.2666666666666657": 1199,
      "TIME_DELTA=0.4062499999999991": 1200,
      "TIME_DELTA=0.8333333333333333": 1201,
      "TIME_DELTA=1.0729166666666665": 1202,
      "TIME_DELTA=0.010416666666666657": 1203,
      "TIME_DELTA=0.5749999999999993": 1204,
      "TIME_DELTA=0.21875000000000178": 1205,
      "TIME_DELTA=1.775": 1206,
      "TIME_DELTA=1.1666666666666665": 1207,
      "TIME_DELTA=0.049999999999998934": 1208,
      "TIME_DELTA=0.7708333333333333": 1209,
      "TIME_DELTA=1.489583333333333": 1210,
      "TIME_DELTA=1.354166666666667": 1211,
      "TIME_DELTA=1.0729166666666679": 1212,
      "TIME_DELTA=0.020833333333333343": 1213,
      "TIME_DELTA=1.385416666666667": 1214,
      "TIME_DELTA=1.7583333333333333": 1215,
      "TIME_DELTA=3.125": 1216,
      "TIME_DELTA=0.3437500000000009": 1217,
      "TIME_DELTA=0.07291666666666666": 1218,
      "TIME_DELTA=1.1145833333333335": 1219,
