{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "BAR_END": 0,
      "BAR_START": 1,
      "NOTE_OFF=62": 2,
      "NOTE_ON=62": 3,
      "NOTE_OFF=67": 4,
      "NOTE_ON=67": 5,
      "NOTE_OFF=65": 6,
      "NOTE_ON=65": 7,
      "NOTE_OFF=60": 8,
      "NOTE_ON=60": 9,
      "NOTE_OFF=64": 10,
      "NOTE_ON=64": 11,
      "NOTE_OFF=69": 12,
      "NOTE_ON=69": 13,
      "NOTE_OFF=72": 14,
      "NOTE_ON=72": 15,
      "NOTE_OFF=74": 16,
      "NOTE_ON=74": 17,
      "NOTE_OFF=63": 18,
      "NOTE_ON=63": 19,
      "NOTE_OFF=55": 20,
      "NOTE_ON=55": 21,
      "NOTE_OFF=57": 22,
      "NOTE_ON=57": 23,
      "NOTE_OFF=58": 24,
      "NOTE_ON=58": 25,
      "NOTE_OFF=68": 26,
      "NOTE_ON=68": 27,
      "NOTE_OFF=70": 28,
      "NOTE_ON=70": 29,
      "NOTE_OFF=61": 30,
      "NOTE_ON=61": 31,
      "TIME_DELTA=0.03125": 32,
      "NOTE_OFF=66": 33,
      "NOTE_ON=66": 34,
      "NOTE_OFF=71": 35,
      "NOTE_ON=71": 36,
      "NOTE_OFF=59": 37,
      "NOTE_ON=59": 38,
      "NOTE_OFF=73": 39,
      "NOTE_ON=73": 40,
      "NOTE_OFF=76": 41,
      "NOTE_ON=76": 42,
      "NOTE_OFF=56": 43,
      "NOTE_ON=56": 44,
      "NOTE_OFF=75": 45,
      "NOTE_ON=75": 46,
      "NOTE_OFF=77": 47,
      "NOTE_ON=77": 48,
      "TIME_DELTA=0.0625": 49,
      "NOTE_OFF=53": 50,
      "NOTE_ON=53": 51,
      "TIME_DELTA=0.125": 52,
      "NOTE_OFF=79": 53,
      "NOTE_ON=79": 54,
      "NOTE_OFF=50": 55,
      "NOTE_ON=50": 56,
      "NOTE_OFF=52": 57,
      "NOTE_ON=52": 58,
      "TIME_DELTA=0.25": 59,
      "NOTE_OFF=54": 60,
      "NOTE_ON=54": 61,
      "TIME_DELTA=0.09375": 62,
      "NOTE_OFF=78": 63,
      "NOTE_ON=78": 64,
      "NOTE_OFF=51": 65,
      "NOTE_ON=51": 66,
      "NOTE_OFF=48": 67,
      "NOTE_ON=48": 68,
      "NOTE_OFF=81": 69,
      "NOTE_ON=81": 70,
      "NOTE_OFF=80": 71,
      "NOTE_ON=80": 72,
      "TIME_DELTA=0.15625": 73,
      "TIME_DELTA=0.28125": 74,
      "NOTE_OFF=49": 75,
      "NOTE_ON=49": 76,
      "TIME_DELTA=0.1875": 77,
      "TIME_DELTA=0.375": 78,
      "TIME_DELTA=0.041666666666666664": 79,
      "TIME_DELTA=0.21875": 80,
      "NOTE_OFF=82": 81,
      "NOTE_ON=82": 82,
      "TIME_DELTA=0.3125": 83,
      "NOTE_OFF=45": 84,
      "NOTE_ON=45": 85,
      "NOTE_OFF=47": 86,
      "NOTE_ON=47": 87,
      "NOTE_OFF=46": 88,
      "NOTE_ON=46": 89,
      "NOTE_OFF=84": 90,
      "NOTE_ON=84": 91,
      "NOTE_OFF=83": 92,
      "NOTE_ON=83": 93,
      "NOTE_OFF=43": 94,
      "NOTE_ON=43": 95,
      "TIME_DELTA=0.34375": 96,
      "NOTE_OFF=44": 97,
      "NOTE_ON=44": 98,
      "TIME_DELTA=0.2916666666666667": 99,
      "TIME_DELTA=0.08333333333333333": 100,
      "NOTE_OFF=86": 101,
      "NOTE_ON=86": 102,
      "TIME_DELTA=0.010416666666666666": 103,
      "NOTE_OFF=85": 104,
      "NOTE_ON=85": 105,
      "TIME_DELTA=0.40625": 106,
      "TIME_DELTA=0.5": 107,
      "TIME_DELTA=0.3333333333333333": 108,
      "TIME_DELTA=0.16666666666666666": 109,
      "NOTE_OFF=41": 110,
      "NOTE_ON=41": 111,
      "TIME_DELTA=0.20833333333333334": 112,
      "TIME_DELTA=0.010416666666666075": 113,
      "TIME_DELTA=0.4375": 114,
      "TIME_DELTA=0.020833333333333332": 115,
      "NOTE_OFF=87": 116,
      "NOTE_ON=87": 117,
      "TIME_DELTA=0.020833333333333925": 118,
      "TIME_DELTA=0.041666666666666075": 119,
      "NOTE_OFF=42": 120,
      "NOTE_ON=42": 121,
      "TIME_DELTA=0.03333333333333333": 122,
      "TIME_DELTA=0.46875": 123,
      "NOTE_OFF=88": 124,
      "NOTE_ON=88": 125,
      "TIME_DELTA=0.052083333333333336": 126,
      "TIME_DELTA=0.4166666666666667": 127,
      "NOTE_OFF=40": 128,
      "NOTE_ON=40": 129,
      "TIME_DELTA=0.2604166666666667": 130,
      "TIME_DELTA=0.052083333333333925": 131,
      "TIME_DELTA=0.07291666666666667": 132,
      "NOTE_OFF=39": 133,
      "NOTE_ON=39": 134,
      "NOTE_OFF=89": 135,
      "NOTE_ON=89": 136,
      "TIME_DELTA=0.625": 137,
      "TIME_DELTA=0.2708333333333333": 138,
      "TIME_DELTA=0.08333333333333393": 139,
      "NOTE_OFF=38": 140,
      "NOTE_ON=38": 141,
      "GENRE=OTHER": 142,
      "INST=0": 143,
      "PIECE_START": 144,
      "TIME_SIGNATURE=4_4": 145,
      "TRACK_END": 146,
      "TRACK_START": 147,
      "TIME_DELTA=0.07291666666666607": 148,
      "NOTE_OFF=36": 149,
      "NOTE_ON=36": 150,
      "TIME_DELTA=0.53125": 151,
      "TIME_DELTA=0.3229166666666667": 152,
      "TIME_DELTA=0.3020833333333333": 153,
      "TIME_DELTA=0.075": 154,
      "TIME_DELTA=0.10416666666666667": 155,
      "TIME_DELTA=0.016666666666666666": 156,
      "TIME_DELTA=0.22916666666666666": 157,
      "TIME_DELTA=0.4583333333333333": 158,
      "TIME_DELTA=0.5625": 159,
      "NOTE_OFF=37": 160,
      "NOTE_ON=37": 161,
      "TIME_DELTA=0.23958333333333334": 162,
      "TIME_DELTA=0.058333333333333334": 163,
      "TIME_DELTA=0.11458333333333333": 164,
      "TIME_DELTA=0.008333333333333333": 165,
      "TIME_DELTA=0.10416666666666607": 166,
      "TIME_DELTA=0.3541666666666667": 167,
      "TIME_DELTA=0.13541666666666666": 168,
      "TIME_DELTA=0.19791666666666666": 169,
      "TIME_DELTA=0.59375": 170,
      "TIME_DELTA=0.05": 171,
      "TIME_DELTA=0.11458333333333393": 172,
      "TIME_DELTA=0.025": 173,
      "TIME_DELTA=0.09166666666666666": 174,
      "NOTE_OFF=90": 175,
      "NOTE_ON=90": 176,
      "TIME_DELTA=0.14583333333333334": 177,
      "TIME_DELTA=0.16666666666666607": 178,
      "TIME_DELTA=0.13541666666666607": 179,
      "TIME_DELTA=0.06666666666666667": 180,
      "TIME_DELTA=0.17708333333333334": 181,
      "NOTE_OFF=91": 182,
      "NOTE_ON=91": 183,
      "TIME_DELTA=0.10833333333333334": 184,
      "TIME_DELTA=0.3854166666666667": 185,
      "TIME_DELTA=0.2604166666666661": 186,
      "TIME_DELTA=0.5416666666666666": 187,
      "TIME_DELTA=0.2916666666666661": 188,
      "TIME_DELTA=0.3645833333333333": 189,
      "TIME_DELTA=0.14583333333333393": 190,
      "TIME_DELTA=0.75": 191,
      "TIME_DELTA=0.20833333333333393": 192,
      "TIME_DELTA=0.275": 193,
      "TIME_DELTA=0.25833333333333336": 194,
      "TIME_DELTA=0.65625": 195,
      "TIME_DELTA=0.19791666666666607": 196,
      "TIME_DELTA=0.2833333333333333": 197,
      "TIME_DELTA=0.2708333333333339": 198,
      "TIME_DELTA=0.11666666666666667": 199,
      "NOTE_OFF=35": 200,
      "NOTE_ON=35": 201,
      "TIME_DELTA=0.17708333333333393": 202,
      "TIME_DELTA=0.22916666666666607": 203,
      "TIME_DELTA=0.26666666666666666": 204,
      "TIME_DELTA=0.1": 205,
      "TIME_DELTA=0.13333333333333333": 206,
      "NOTE_OFF=92": 207,
      "NOTE_ON=92": 208,
      "TIME_DELTA=0.3958333333333333": 209,
      "TIME_DELTA=0.5833333333333334": 210,
      "TIME_DELTA=0.31666666666666665": 211,
      "TIME_DELTA=0.15": 212,
      "TIME_DELTA=0.30833333333333335": 213,
      "NOTE_OFF=33": 214,
      "NOTE_ON=33": 215,
      "TIME_DELTA=0.3": 216,
      "NOTE_OFF=34": 217,
      "NOTE_ON=34": 218,
      "TIME_DELTA=0.010416666666666963": 219,
      "TIME_DELTA=0.3229166666666661": 220,
      "TIME_DELTA=0.6875": 221,
      "TIME_DELTA=0.23958333333333393": 222,
      "TIME_DELTA=0.14166666666666666": 223,
      "TIME_DELTA=0.04166666666666696": 224,
      "TIME_DELTA=0.4479166666666667": 225,
      "TIME_DELTA=0.3020833333333339": 226,
      "TIME_DELTA=0.020833333333333037": 227,
      "TIME_DELTA=0.18333333333333332": 228,
      "TIME_DELTA=0.4270833333333333": 229,
      "TIME_DELTA=0.24166666666666667": 230,
      "TIME_DELTA=0.3333333333333339": 231,
      "TIME_DELTA=0.325": 232,
      "TIME_DELTA=0.15833333333333333": 233,
      "TIME_DELTA=0.71875": 234,
      "TIME_DELTA=0.2": 235,
      "TIME_DELTA=0.21666666666666667": 236,
      "TIME_DELTA=0.225": 237,
      "TIME_DELTA=0.23333333333333334": 238,
      "TIME_DELTA=0.175": 239,
      "TIME_DELTA=0.19166666666666668": 240,
      "TIME_DELTA=0.4791666666666667": 241,
      "NOTE_OFF=93": 242,
      "NOTE_ON=93": 243,
      "TIME_DELTA=0.3541666666666661": 244,
      "TIME_DELTA=0.3416666666666667": 245,
      "TIME_DELTA=0.35": 246,
      "TIME_DELTA=0.6666666666666666": 247,
      "TIME_DELTA=0.05208333333333304": 248,
      "TIME_DELTA=0.5104166666666666": 249,
      "TIME_DELTA=0.35833333333333334": 250,
      "TIME_DELTA=0.875": 251,
      "TIME_DELTA=0.36666666666666664": 252,
      "TIME_DELTA=0.4895833333333333": 253,
      "NOTE_OFF=32": 254,
      "NOTE_ON=32": 255,
      "TIME_DELTA=0.08333333333333304": 256,
      "TIME_DELTA=0.4166666666666661": 257,
      "TIME_DELTA=0.3854166666666661": 258,
      "TIME_DELTA=0.78125": 259,
      "NOTE_OFF=94": 260,
      "NOTE_ON=94": 261,
      "TIME_DELTA=0.07291666666666696": 262,
      "TIME_DELTA=0.3645833333333339": 263,
      "TIME_DELTA=0.38333333333333336": 264,
      "TIME_DELTA=0.5208333333333334": 265,
      "TIME_DELTA=0.39166666666666666": 266,
      "TIME_DELTA=0.7083333333333334": 267,
      "TIME_DELTA=0.4": 268,
      "NOTE_OFF=31": 269,
      "NOTE_ON=31": 270,
      "TIME_DELTA=0.4083333333333333": 271,
      "TIME_DELTA=0.8125": 272,
      "TIME_DELTA=0.5520833333333334": 273,
      "TIME_DELTA=0.10416666666666696": 274,
      "TIME_DELTA=0.5729166666666666": 275,
      "TIME_DELTA=0.3958333333333339": 276,
      "TIME_DELTA=0.43333333333333335": 277,
      "TIME_DELTA=0.84375": 278,
      "TIME_DELTA=0.425": 279,
      "TIME_DELTA=0.44166666666666665": 280,
      "TIME_DELTA=0.4479166666666661": 281,
      "TIME_DELTA=0.11458333333333304": 282,
      "TIME_DELTA=0.16666666666666696": 283,
      "TIME_DELTA=0.6041666666666666": 284,
      "TIME_DELTA=0.45": 285,
      "TIME_DELTA=0.4270833333333339": 286,
      "TIME_DELTA=0.26041666666666696": 287,
      "NOTE_OFF=95": 288,
      "NOTE_ON=95": 289,
      "TIME_DELTA=0.13541666666666696": 290,
      "TIME_DELTA=0.4583333333333339": 291,
      "TIME_DELTA=1.0": 292,
      "TIME_DELTA=0.29166666666666696": 293,
      "TIME_DELTA=0.6145833333333334": 294,
      "TIME_DELTA=0.7916666666666666": 295,
      "TIME_DELTA=0.4666666666666667": 296,
      "TIME_DELTA=0.6354166666666666": 297,
      "TIME_DELTA=0.14583333333333304": 298,
      "TIME_DELTA=0.4791666666666661": 299,
      "TIME_DELTA=0.475": 300,
      "TIME_DELTA=0.20833333333333304": 301,
      "TIME_DELTA=0.90625": 302,
      "TIME_DELTA=0.6458333333333334": 303,
      "TIME_DELTA=0.27083333333333304": 304,
      "TIME_DELTA=0.48333333333333334": 305,
      "TIME_DELTA=0.19791666666666696": 306,
      "TIME_DELTA=0.5083333333333333": 307,
      "TIME_DELTA=0.8333333333333334": 308,
      "TIME_DELTA=0.22916666666666696": 309,
      "TIME_DELTA=0.010416666666666519": 310,
      "TIME_DELTA=0.17708333333333304": 311,
      "TIME_DELTA=0.49166666666666664": 312,
      "NOTE_OFF=97": 313,
      "NOTE_ON=97": 314,
      "TIME_DELTA=0.4895833333333339": 315,
      "TIME_DELTA=0.5104166666666661": 316,
      "TIME_DELTA=0.5416666666666661": 317,
      "TIME_DELTA=0.9375": 318,
      "TIME_DELTA=0.04166666666666652": 319,
      "NOTE_OFF=30": 320,
      "NOTE_ON=30": 321,
      "TIME_DELTA=0.6770833333333334": 322,
      "TIME_DELTA=0.30208333333333304": 323,
      "TIME_DELTA=0.02083333333333348": 324,
      "TIME_DELTA=0.5166666666666667": 325,
      "TIME_DELTA=0.23958333333333304": 326,
      "TIME_DELTA=0.96875": 327,
      "TIME_DELTA=0.32291666666666696": 328,
      "TIME_DELTA=0.525": 329,
      "TIME_DELTA=0.33333333333333304": 330,
      "TIME_DELTA=0.04166666666666785": 331,
      "TIME_DELTA=0.010416666666667851": 332,
      "TIME_DELTA=0.6979166666666666": 333,
      "TIME_DELTA=0.02083333333333215": 334,
      "TIME_DELTA=0.5333333333333333": 335,
      "TIME_DELTA=1.125": 336,
      "NOTE_OFF=96": 337,
      "NOTE_ON=96": 338,
      "TIME_DELTA=0.5208333333333339": 339,
      "TIME_DELTA=0.55": 340,
      "TIME_DELTA=0.5583333333333333": 341,
      "TIME_DELTA=0.7291666666666666": 342,
      "TIME_DELTA=0.35416666666666696": 343,
      "TIME_DELTA=0.5833333333333339": 344,
      "TIME_DELTA=0.5729166666666661": 345,
      "TIME_DELTA=0.5520833333333339": 346,
      "TIME_DELTA=0.5666666666666667": 347,
      "TIME_DELTA=0.05208333333333215": 348,
      "TIME_DELTA=0.575": 349,
      "TIME_DELTA=0.7395833333333334": 350,
      "TIME_DELTA=0.05208333333333348": 351,
      "TIME_DELTA=0.08333333333333215": 352,
      "TIME_DELTA=1.03125": 353,
      "NOTE_OFF=29": 354,
      "NOTE_ON=29": 355,
      "TIME_DELTA=0.9166666666666666": 356,
      "TIME_DELTA=0.07291666666666785": 357,
      "TIME_DELTA=0.08333333333333348": 358,
      "TIME_DELTA=0.5916666666666667": 359,
      "TIME_DELTA=0.7604166666666666": 360,
      "NOTE_OFF=99": 361,
      "NOTE_ON=99": 362,
      "TIME_DELTA=1.0625": 363,
      "TIME_DELTA=0.38541666666666696": 364,
      "TIME_DELTA=0.7708333333333334": 365,
      "TIME_DELTA=0.6166666666666667": 366,
      "TIME_DELTA=0.6041666666666661": 367,
      "TIME_DELTA=0.033333333333333215": 368,
      "TIME_DELTA=0.07291666666666652": 369,
      "TIME_DELTA=0.10416666666666785": 370,
      "TIME_DELTA=0.41666666666666696": 371,
      "TIME_DELTA=0.6": 372,
      "TIME_DELTA=0.36458333333333304": 373,
      "TIME_DELTA=0.6333333333333333": 374,
      "TIME_DELTA=0.6083333333333333": 375,
      "TIME_DELTA=0.16666666666666785": 376,
      "TIME_DELTA=0.13541666666666785": 377,
      "TIME_DELTA=1.09375": 378,
      "TIME_DELTA=0.9583333333333334": 379,
      "TIME_DELTA=1.25": 380,
      "TIME_DELTA=0.11458333333333215": 381,
      "TIME_DELTA=0.6145833333333339": 382,
      "TIME_DELTA=0.8020833333333334": 383,
      "TIME_DELTA=0.6354166666666661": 384,
      "TIME_DELTA=0.6666666666666661": 385,
      "TIME_DELTA=0.14583333333333215": 386,
      "TIME_DELTA=0.6416666666666667": 387,
      "TIME_DELTA=0.10416666666666652": 388,
      "TIME_DELTA=0.29166666666666785": 389,
      "TIME_DELTA=0.26041666666666785": 390,
      "NOTE_OFF=98": 391,
      "NOTE_ON=98": 392,
      "TIME_DELTA=0.6458333333333339": 393,
      "TIME_DELTA=0.8229166666666666": 394,
      "TIME_DELTA=0.39583333333333304": 395,
      "TIME_DELTA=0.65": 396,
      "TIME_DELTA=0.19791666666666785": 397,
      "TIME_DELTA=0.6583333333333333": 398,
      "TIME_DELTA=0.20833333333333215": 399,
      "TIME_DELTA=1.15625": 400,
      "TIME_DELTA=0.17708333333333215": 401,
      "DENSITY=4": 402,
      "TIME_DELTA=0.16666666666666652": 403,
      "DENSITY=3": 404,
      "DENSITY=1": 405,
      "DENSITY=2": 406,
      "TIME_DELTA=0.8541666666666666": 407,
      "TIME_DELTA=0.11458333333333348": 408,
      "TIME_DELTA=0.44791666666666696": 409,
      "TIME_DELTA=0.7083333333333339": 410,
      "DENSITY=0": 411,
      "TIME_DELTA=0.22916666666666785": 412,
      "TIME_DELTA=0.675": 413,
      "TIME_DELTA=1.0416666666666667": 414,
      "TIME_DELTA=0.13541666666666652": 415,
      "TIME_DELTA=0.6770833333333339": 416,
      "TIME_DELTA=0.27083333333333215": 417,
      "TIME_DELTA=0.2916666666666665": 418,
      "TIME_DELTA=0.42708333333333304": 419,
      "TIME_DELTA=0.6833333333333333": 420,
      "TIME_DELTA=0.45833333333333304": 421,
      "TIME_DELTA=0.6916666666666667": 422,
      "TIME_DELTA=0.8645833333333334": 423,
      "TIME_DELTA=1.1875": 424,
      "TIME_DELTA=0.6979166666666661": 425,
      "TIME_DELTA=0.7": 426,
      "TIME_DELTA=0.2604166666666665": 427,
      "TIME_DELTA=0.23958333333333215": 428,
      "TIME_DELTA=1.0833333333333333": 429,
      "TIME_DELTA=0.32291666666666785": 430,
      "TIME_DELTA=0.14583333333333348": 431,
      "TIME_DELTA=1.375": 432,
      "TIME_DELTA=0.30208333333333215": 433,
      "TIME_DELTA=0.8854166666666666": 434,
      "TIME_DELTA=1.21875": 435,
      "TIME_DELTA=0.20833333333333348": 436,
      "TIME_DELTA=0.47916666666666696": 437,
      "NOTE_OFF=100": 438,
      "NOTE_ON=100": 439,
      "TIME_DELTA=0.7291666666666661": 440,
      "TIME_DELTA=0.8958333333333334": 441,
      "TIME_DELTA=0.7395833333333339": 442,
      "TIME_DELTA=0.33333333333333215": 443,
      "TIME_DELTA=0.2708333333333335": 444,
      "TIME_DELTA=0.7166666666666667": 445,
      "TIME_DELTA=0.17708333333333348": 446,
      "TIME_DELTA=0.725": 447,
      "TIME_DELTA=0.04166666666666674": 448,
      "TIME_DELTA=0.19791666666666652": 449,
      "TIME_DELTA=0.09166666666666679": 450,
      "TIME_DELTA=0.01041666666666674": 451,
      "TIME_DELTA=0.22916666666666652": 452,
      "TIME_DELTA=0.7333333333333333": 453,
      "TIME_DELTA=0.7416666666666667": 454,
      "TIME_DELTA=0.541666666666667": 455,
      "TIME_DELTA=0.9270833333333334": 456,
      "TIME_DELTA=0.510416666666667": 457,
      "TIME_DELTA=0.7916666666666661": 458,
      "TIME_DELTA=0.7583333333333333": 459,
      "TIME_DELTA=0.7604166666666661": 460,
      "TIME_DELTA=1.28125": 461,
      "TIME_DELTA=0.35416666666666785": 462,
      "TIME_DELTA=0.02083333333333326": 463,
      "TIME_DELTA=0.48958333333333304": 464,
      "TIME_DELTA=0.3333333333333335": 465,
      "TIME_DELTA=0.7708333333333339": 466,
      "TIME_DELTA=1.5": 467,
      "TIME_DELTA=0.3020833333333335": 468,
      "TIME_DELTA=0.23958333333333348": 469,
      "TIME_DELTA=1.3125": 470,
      "TIME_DELTA=0.05833333333333357": 471,
      "TIME_DELTA=0.3229166666666665": 472,
      "TIME_DELTA=0.520833333333333": 473,
      "TIME_DELTA=0.8333333333333339": 474,
      "TIME_DELTA=0.8020833333333339": 475,
      "TIME_DELTA=1.1666666666666667": 476,
      "TIME_DELTA=0.7666666666666667": 477,
      "TIME_DELTA=0.38541666666666785": 478,
      "TIME_DELTA=0.9479166666666666": 479,
      "TIME_DELTA=0.41666666666666785": 480,
      "TIME_DELTA=0.775": 481,
      "TIME_DELTA=1.2083333333333333": 482,
      "TIME_DELTA=1.34375": 483,
      "TIME_DELTA=0.8229166666666661": 484,
      "TIME_DELTA=1.0208333333333333": 485,
      "TIME_DELTA=0.36458333333333215": 486,
      "TIME_DELTA=0.7833333333333333": 487,
      "TIME_DELTA=0.9895833333333334": 488,
      "TIME_DELTA=0.9791666666666666": 489,
      "TIME_DELTA=0.06666666666666643": 490,
      "TIME_DELTA=0.3541666666666665": 491,
      "TIME_DELTA=1.0104166666666667": 492,
      "TIME_DELTA=0.552083333333333": 493,
      "TIME_DELTA=0.583333333333333": 494,
      "TIME_DELTA=1.625": 495,
      "TIME_DELTA=1.40625": 496,
      "TIME_DELTA=0.8": 497,
      "TIME_DELTA=0.8166666666666667": 498,
      "TIME_DELTA=0.08333333333333326": 499,
      "TIME_DELTA=0.05208333333333326": 500,
      "TIME_DELTA=0.8083333333333333": 501,
      "TIME_DELTA=0.572916666666667": 502,
      "TIME_DELTA=1.0520833333333333": 503,
      "TIME_DELTA=0.39583333333333215": 504,
      "TIME_DELTA=0.8541666666666661": 505,
      "TIME_DELTA=0.4166666666666665": 506,
      "TIME_DELTA=1.4375": 507,
      "TIME_DELTA=0.07291666666666674": 508,
      "TIME_DELTA=0.3854166666666665": 509,
      "TIME_DELTA=1.46875": 510,
      "TIME_DELTA=0.604166666666667": 511,
      "TIME_DELTA=0.15833333333333321": 512,
      "TIME_DELTA=0.025000000000000355": 513,
      "TIME_DELTA=0.8645833333333339": 514,
      "TIME_DELTA=0.825": 515,
      "TIME_DELTA=0.8958333333333339": 516,
      "TIME_DELTA=0.44791666666666785": 517,
      "TIME_DELTA=1.0729166666666667": 518,
      "TIME_DELTA=0.3645833333333335": 519,
      "TIME_DELTA=0.8854166666666661": 520,
      "TIME_DELTA=0.42708333333333215": 521,
      "TIME_DELTA=0.9166666666666661": 522,
      "TIME_DELTA=0.2833333333333332": 523,
      "TIME_DELTA=0.666666666666667": 524,
      "TIME_DELTA=0.21666666666666679": 525,
      "TIME_DELTA=0.8666666666666667": 526,
      "NOTE_OFF=28": 527,
      "NOTE_ON=28": 528,
      "TIME_DELTA=0.85": 529,
      "TIME_DELTA=0.8416666666666667": 530,
      "TIME_DELTA=1.1145833333333333": 531,
      "TIME_DELTA=0.635416666666667": 532,
      "TIME_DELTA=1.2916666666666667": 533,
      "TIME_DELTA=0.614583333333333": 534,
      "TIME_DELTA=1.53125": 535,
      "TIME_DELTA=0.45833333333333215": 536,
      "TIME_DELTA=1.1041666666666667": 537,
      "TIME_DELTA=0.10416666666666674": 538,
      "TIME_DELTA=1.75": 539,
      "TIME_DELTA=1.3333333333333333": 540,
      "TIME_DELTA=1.5625": 541,
      "TIME_DELTA=0.47916666666666785": 542,
      "TIME_DELTA=0.29166666666666674": 543,
      "TIME_DELTA=0.9583333333333339": 544,
      "TIME_DELTA=0.8583333333333333": 545,
      "TIME_DELTA=0.9270833333333339": 546,
      "TIME_DELTA=0.016666666666666607": 547,
      "TIME_DELTA=0.3958333333333335": 548,
      "TIME_DELTA=0.18333333333333357": 549,
      "TIME_DELTA=0.645833333333333": 550,
      "TIME_DELTA=0.8833333333333333": 551,
      "TIME_DELTA=0.708333333333333": 552,
      "TIME_DELTA=0.16666666666666674": 553,
      "TIME_DELTA=1.59375": 554,
      "TIME_DELTA=1.1458333333333333": 555,
      "TIME_DELTA=0.26041666666666674": 556,
      "TIME_DELTA=1.1354166666666667": 557,
      "TIME_DELTA=0.11458333333333326": 558,
      "NOTE_OFF=101": 559,
      "NOTE_ON=101": 560,
      "TIME_DELTA=0.13541666666666674": 561,
      "TIME_DELTA=0.09999999999999964": 562,
      "TIME_DELTA=0.15000000000000036": 563,
      "TIME_DELTA=0.8916666666666667": 564,
      "TIME_DELTA=0.4479166666666665": 565,
      "TIME_DELTA=0.9083333333333333": 566,
      "TIME_DELTA=0.9479166666666661": 567,
      "TIME_DELTA=0.677083333333333": 568,
      "TIME_DELTA=1.65625": 569,
      "TIME_DELTA=0.9": 570,
      "TIME_DELTA=1.1770833333333333": 571,
      "TIME_DELTA=0.3416666666666668": 572,
      "TIME_DELTA=0.4583333333333335": 573,
      "TIME_DELTA=0.00833333333333286": 574,
      "TIME_DELTA=0.48958333333333215": 575,
      "TIME_DELTA=0.07499999999999929": 576,
      "TIME_DELTA=0.9895833333333339": 577,
      "TIME_DELTA=0.5416666666666679": 578,
      "TIME_DELTA=0.19166666666666643": 579,
      "TIME_DELTA=0.20833333333333326": 580,
      "NOTE_OFF=27": 581,
      "NOTE_ON=27": 582,
      "TIME_DELTA=0.31666666666666643": 583,
      "TIME_DELTA=0.4270833333333335": 584,
      "TIME_DELTA=0.27083333333333326": 585,
      "TIME_DELTA=0.5104166666666679": 586,
      "TIME_DELTA=0.697916666666667": 587,
      "TIME_DELTA=0.925": 588,
      "TIME_DELTA=0.14583333333333326": 589,
      "TIME_DELTA=0.30833333333333357": 590,
      "TIME_DELTA=0.9416666666666667": 591,
      "TIME_DELTA=0.9333333333333333": 592,
      "TIME_DELTA=0.5416666666666665": 593,
      "TIME_DELTA=1.6875": 594,
      "TIME_DELTA=0.27500000000000036": 595,
      "TIME_DELTA=0.4791666666666665": 596,
      "TIME_DELTA=1.4166666666666667": 597,
      "TIME_DELTA=0.9791666666666661": 598,
      "TIME_DELTA=0.739583333333333": 599,
      "TIME_DELTA=1.4583333333333333": 600,
      "TIME_DELTA=0.04166666666666663": 601,
      "TIME_DELTA=0.10833333333333339": 602,
      "TIME_DELTA=1.875": 603,
      "TIME_DELTA=0.95": 604,
      "TIME_DELTA=0.729166666666667": 605,
      "TIME_DELTA=1.71875": 606,
      "TIME_DELTA=0.01041666666666663": 607,
      "TIME_DELTA=0.33333333333333326": 608,
      "TIME_DELTA=1.041666666666666": 609,
      "TIME_DELTA=1.1979166666666667": 610,
      "TIME_DELTA=0.5104166666666665": 611,
      "TIME_DELTA=1.2395833333333333": 612,
      "TIME_DELTA=1.020833333333334": 613,
      "TIME_DELTA=0.19791666666666674": 614,
      "TIME_DELTA=0.22499999999999964": 615,
      "TIME_DELTA=1.010416666666666": 616,
      "TIME_DELTA=0.791666666666667": 617,
      "TIME_DELTA=0.32291666666666674": 618,
      "TIME_DELTA=0.5208333333333321": 619,
      "TIME_DELTA=0.30208333333333326": 620,
      "TIME_DELTA=0.22916666666666674": 621,
      "TIME_DELTA=0.02083333333333337": 622,
      "TIME_DELTA=0.17708333333333326": 623,
      "TIME_DELTA=1.2708333333333333": 624,
      "TIME_DELTA=0.9666666666666667": 625,
      "TIME_DELTA=0.9916666666666667": 626,
      "TIME_DELTA=0.07500000000000018": 627,
      "TIME_DELTA=0.13333333333333286": 628,
      "TIME_DELTA=1.083333333333334": 629,
      "TIME_DELTA=0.4895833333333335": 630,
      "TIME_DELTA=1.0166666666666666": 631,
      "TIME_DELTA=0.5520833333333321": 632,
      "TIME_DELTA=0.11666666666666714": 633,
      "TIME_DELTA=0.016666666666667496": 634,
      "TIME_DELTA=0.770833333333333": 635,
      "TIME_DELTA=1.052083333333334": 636,
      "TIME_DELTA=0.5208333333333335": 637,
      "TIME_DELTA=0.5729166666666679": 638,
      "TIME_DELTA=1.0083333333333333": 639,
      "TIME_DELTA=0.760416666666667": 640,
      "TIME_DELTA=1.2291666666666667": 641,
      "TIME_DELTA=1.78125": 642,
      "TIME_DELTA=0.975": 643,
      "TIME_DELTA=0.5833333333333321": 644,
      "TIME_DELTA=2.0": 645,
      "TIME_DELTA=0.9833333333333333": 646,
      "TIME_DELTA=0.5833333333333335": 647,
      "TIME_DELTA=1.2604166666666667": 648,
      "TIME_DELTA=0.23958333333333326": 649,
      "TIME_DELTA=0.05000000000000071": 650,
      "TIME_DELTA=1.3020833333333333": 651,
      "TIME_DELTA=1.5416666666666667": 652,
      "TIME_DELTA=0.4083333333333332": 653,
      "TIME_DELTA=0.833333333333333": 654,
      "TIME_DELTA=0.35416666666666674": 655,
      "TIME_DELTA=0.802083333333333": 656,
      "TIME_DELTA=1.5833333333333333": 657,
      "TIME_DELTA=0.1416666666666666": 658,
      "TIME_DELTA=1.8125": 659,
      "TIME_DELTA=0.5520833333333335": 660,
      "TIME_DELTA=0.41666666666666674": 661,
      "TIME_DELTA=1.072916666666666": 662,
      "TIME_DELTA=0.6041666666666679": 663,
      "TIME_DELTA=1.025": 664,
      "TIME_DELTA=0.25833333333333286": 665,
      "TIME_DELTA=0.5729166666666665": 666,
      "TIME_DELTA=0.05208333333333337": 667,
      "TIME_DELTA=0.34999999999999964": 668,
      "TIME_DELTA=1.84375": 669,
      "TIME_DELTA=1.0333333333333334": 670,
      "TIME_DELTA=1.3645833333333333": 671,
      "TIME_DELTA=1.05": 672,
      "TIME_DELTA=0.2666666666666666": 673,
      "TIME_DELTA=1.114583333333334": 674,
      "TIME_DELTA=0.38541666666666674": 675,
      "NOTE_OFF=25": 676,
      "NOTE_ON=25": 677,
      "TIME_DELTA=1.3229166666666667": 678,
      "TIME_DELTA=0.08333333333333337": 679,
      "TIME_DELTA=0.6041666666666665": 680,
      "NOTE_OFF=26": 681,
      "NOTE_ON=26": 682,
      "TIME_DELTA=0.822916666666667": 683,
      "TIME_DELTA=1.104166666666666": 684,
      "TIME_DELTA=0.36458333333333326": 685,
      "TIME_DELTA=1.145833333333334": 686,
      "TIME_DELTA=1.0583333333333333": 687,
      "TIME_DELTA=1.3958333333333333": 688,
      "TIME_DELTA=1.1083333333333334": 689,
      "TIME_DELTA=1.3541666666666667": 690,
      "TIME_DELTA=1.135416666666666": 691,
      "TIME_DELTA=1.6666666666666667": 692,
      "TIME_DELTA=1.90625": 693,
      "TIME_DELTA=0.1083333333333325": 694,
      "TIME_DELTA=0.6145833333333321": 695,
      "TIME_DELTA=0.854166666666667": 696,
      "TIME_DELTA=0.864583333333333": 697,
      "TIME_DELTA=0.6666666666666679": 698,
      "TIME_DELTA=1.166666666666666": 699,
      "TIME_DELTA=0.24166666666666714": 700,
      "TIME_DELTA=2.125": 701,
      "TIME_DELTA=1.177083333333334": 702,
      "TIME_DELTA=1.4270833333333333": 703,
      "TIME_DELTA=0.04999999999999982": 704,
      "TIME_DELTA=0.4666666666666668": 705,
      "TIME_DELTA=0.6354166666666679": 706,
      "TIME_DELTA=0.6666666666666665": 707,
      "TIME_DELTA=1.208333333333334": 708,
      "TIME_DELTA=0.6145833333333335": 709,
      "TIME_DELTA=1.1": 710,
      "TIME_DELTA=0.2333333333333334": 711,
      "TIME_DELTA=1.0666666666666667": 712,
      "TIME_DELTA=0.07291666666666663": 713,
      "TIME_DELTA=1.0916666666666666": 714,
      "TIME_DELTA=0.6354166666666665": 715,
      "TIME_DELTA=1.7083333333333333": 716,
      "TIME_DELTA=1.3854166666666667": 717,
      "TIME_DELTA=1.1166666666666667": 718,
      "TIME_DELTA=0.6458333333333321": 719,
      "TIME_DELTA=1.075": 720,
      "TIME_DELTA=0.43333333333333357": 721,
      "TIME_DELTA=0.008333333333333304": 722,
      "TIME_DELTA=1.9375": 723,
      "TIME_DELTA=0.916666666666667": 724,
      "TIME_DELTA=0.885416666666667": 725,
      "TIME_DELTA=1.1416666666666666": 726,
      "TIME_DELTA=0.39583333333333326": 727,
      "TIME_DELTA=0.29166666666666663": 728,
      "TIME_DELTA=1.1333333333333333": 729,
      "TIME_DELTA=0.895833333333333": 730,
      "TIME_DELTA=0.44166666666666643": 731,
      "TIME_DELTA=2.25": 732,
      "TIME_DELTA=1.7763568394002505e-15": 733,
      "TIME_DELTA=1.96875": 734,
      "TIME_DELTA=0.10416666666666663": 735,
      "TIME_DELTA=0.45833333333333326": 736,
      "TIME_DELTA=2.0625": 737,
      "TIME_DELTA=0.6458333333333335": 738,
      "TIME_DELTA=1.7916666666666667": 739,
      "TIME_DELTA=1.15": 740,
      "TIME_DELTA=0.16666666666666663": 741,
      "TIME_DELTA=0.958333333333333": 742,
      "TIME_DELTA=2.03125": 743,
      "TIME_DELTA=0.40000000000000036": 744,
      "TIME_DELTA=1.239583333333334": 745,
      "TIME_DELTA=0.7083333333333335": 746,
      "TIME_DELTA=0.6770833333333321": 747,
      "TIME_DELTA=1.4895833333333333": 748,
      "TIME_DELTA=0.6770833333333335": 749,
      "TIME_DELTA=0.7083333333333321": 750,
      "TIME_DELTA=0.5333333333333332": 751,
      "TIME_DELTA=1.4479166666666667": 752,
      "TIME_DELTA=0.6979166666666679": 753,
      "TIME_DELTA=1.8333333333333333": 754,
      "TIME_DELTA=0.1416666666666675": 755,
      "TIME_DELTA=0.6979166666666665": 756,
      "TIME_DELTA=1.197916666666666": 757,
      "TIME_DELTA=0.1750000000000007": 758,
      "TIME_DELTA=0.1999999999999993": 759,
      "TIME_DELTA=0.26041666666666663": 760,
      "TIME_DELTA=1.270833333333334": 761,
      "TIME_DELTA=1.1583333333333334": 762,
      "TIME_DELTA=0.927083333333333": 763,
      "TIME_DELTA=0.42708333333333326": 764,
      "TIME_DELTA=0.44791666666666674": 765,
      "TIME_DELTA=1.5208333333333333": 766,
      "TIME_DELTA=1.5104166666666667": 767,
      "TIME_DELTA=0.11458333333333337": 768,
      "TIME_DELTA=0.20833333333333337": 769,
      "TIME_DELTA=1.4791666666666667": 770,
      "TIME_DELTA=0.2583333333333333": 771,
      "TIME_DELTA=0.36666666666666714": 772,
      "TIME_DELTA=1.1833333333333333": 773,
      "TIME_DELTA=1.1916666666666667": 774,
      "TIME_DELTA=1.5520833333333333": 775,
      "TIME_DELTA=0.3583333333333334": 776,
      "TIME_DELTA=1.229166666666666": 777,
      "NOTE_OFF=102": 778,
      "NOTE_ON=102": 779,
      "TIME_DELTA=2.09375": 780,
      "TIME_DELTA=0.20000000000000018": 781,
      "TIME_DELTA=0.13541666666666663": 782,
      "TIME_DELTA=0.2666666666666675": 783,
      "TIME_DELTA=0.947916666666667": 784,
      "TIME_DELTA=1.175": 785,
      "TIME_DELTA=1.291666666666666": 786,
      "TIME_DELTA=0.1333333333333333": 787,
      "TIME_DELTA=0.3000000000000007": 788,
      "TIME_DELTA=1.302083333333334": 789,
      "TIME_DELTA=0.1166666666666667": 790,
      "TIME_DELTA=0.47916666666666674": 791,
      "TIME_DELTA=1.260416666666666": 792,
      "TIME_DELTA=1.333333333333334": 793,
      "TIME_DELTA=1.2333333333333334": 794,
      "TIME_DELTA=0.7395833333333335": 795,
      "TIME_DELTA=1.225": 796,
      "TIME_DELTA=8.881784197001252e-16": 797,
      "TIME_DELTA=1.9166666666666667": 798,
      "TIME_DELTA=0.7291666666666665": 799,
      "TIME_DELTA=0.041666666666666685": 800,
      "TIME_DELTA=0.7395833333333321": 801,
      "TIME_DELTA=0.3249999999999993": 802,
      "TIME_DELTA=2.15625": 803,
      "TIME_DELTA=0.38333333333333286": 804,
      "TIME_DELTA=0.979166666666667": 805,
      "TIME_DELTA=0.17499999999999982": 806,
      "TIME_DELTA=1.020833333333333": 807,
      "TIME_DELTA=0.7291666666666679": 808,
      "TIME_DELTA=0.19791666666666663": 809,
      "TIME_DELTA=0.22916666666666663": 810,
      "TIME_DELTA=1.5729166666666667": 811,
      "TIME_DELTA=0.14583333333333337": 812,
      "TIME_DELTA=0.7604166666666679": 813,
      "TIME_DELTA=2.0416666666666665": 814,
      "TIME_DELTA=0.7916666666666665": 815,
      "TIME_DELTA=1.2666666666666666": 816,
      "TIME_DELTA=1.2166666666666666": 817,
      "TIME_DELTA=0.7604166666666665": 818,
      "TIME_DELTA=0.3916666666666666": 819,
      "TIME_DELTA=0.7916666666666679": 820,
      "TIME_DELTA=1.2": 821,
      "TIME_DELTA=1.6041666666666667": 822,
      "TIME_DELTA=0.5416666666666667": 823,
      "TIME_DELTA=0.2333333333333325": 824,
      "TIME_DELTA=0.010416666666666685": 825,
      "TIME_DELTA=0.5916666666666668": 826,
      "TIME_DELTA=2.375": 827,
      "TIME_DELTA=0.989583333333333": 828,
      "TIME_DELTA=1.2583333333333333": 829,
      "TIME_DELTA=16.0": 830,
      "TIME_DELTA=1.010416666666667": 831,
      "TIME_DELTA=1.322916666666666": 832,
      "TIME_DELTA=1.6145833333333333": 833,
      "TIME_DELTA=1.041666666666667": 834,
      "TIME_DELTA=1.2416666666666667": 835,
      "TIME_DELTA=0.2999999999999998": 836,
      "TIME_DELTA=0.47499999999999964": 837,
      "TIME_DELTA=0.27083333333333337": 838,
      "TIME_DELTA=0.17708333333333337": 839,
      "TIME_DELTA=2.21875": 840,
      "NOTE_OFF=24": 841,
      "NOTE_ON=24": 842,
      "TIME_DELTA=0.7708333333333335": 843,
      "TIME_DELTA=1.052083333333333": 844,
      "TIME_DELTA=0.8333333333333335": 845,
      "TIME_DELTA=0.48958333333333326": 846,
      "TIME_DELTA=1.083333333333333": 847,
      "TIME_DELTA=2.1875": 848,
      "TIME_DELTA=0.33333333333333337": 849,
      "TIME_DELTA=1.275": 850,
      "TIME_DELTA=0.5104166666666667": 851,
      "TIME_DELTA=1.9583333333333333": 852,
      "TIME_DELTA=1.364583333333334": 853,
      "TIME_DELTA=2.0833333333333335": 854,
      "TIME_DELTA=1.6354166666666667": 855,
      "TIME_DELTA=0.7708333333333321": 856,
      "TIME_DELTA=0.05833333333333335": 857,
      "TIME_DELTA=1.416666666666666": 858,
      "TIME_DELTA=1.6458333333333333": 859,
      "TIME_DELTA=0.020833333333333315": 860,
      "TIME_DELTA=0.23958333333333337": 861,
      "TIME_DELTA=0.3250000000000002": 862,
      "TIME_DELTA=0.8020833333333335": 863,
      "TIME_DELTA=2.1666666666666665": 864,
      "TIME_DELTA=1.354166666666666": 865,
      "TIME_DELTA=1.3583333333333334": 866,
      "TIME_DELTA=1.458333333333334": 867,
      "TIME_DELTA=1.6770833333333333": 868,
      "TIME_DELTA=1.2833333333333334": 869,
      "TIME_DELTA=2.5": 870,
      "TIME_DELTA=0.2416666666666667": 871,
      "TIME_DELTA=0.5583333333333336": 872,
      "TIME_DELTA=0.8229166666666679": 873,
      "TIME_DELTA=1.3": 874,
      "TIME_DELTA=0.32291666666666663": 875,
      "TIME_DELTA=1.072916666666667": 876,
      "TIME_DELTA=2.28125": 877,
      "TIME_DELTA=0.8333333333333321": 878,
      "TIME_DELTA=0.30208333333333337": 879,
      "TIME_DELTA=1.385416666666666": 880,
      "TIME_DELTA=0.02499999999999991": 881,
      "TIME_DELTA=1.395833333333334": 882,
      "TIME_DELTA=0.8020833333333321": 883,
      "TIME_DELTA=0.08333333333333331": 884,
      "TIME_DELTA=0.5833333333333333": 885,
      "TIME_DELTA=0.5208333333333333": 886,
      "TIME_DELTA=1.6979166666666667": 887,
      "TIME_DELTA=0.16666666666666669": 888,
      "TIME_DELTA=0.5666666666666664": 889,
      "TIME_DELTA=0.008333333333333748": 890,
      "TIME_DELTA=2.3125": 891,
      "TIME_DELTA=1.3083333333333333": 892,
      "TIME_DELTA=0.033333333333333326": 893,
      "TIME_DELTA=0.5250000000000004": 894,
      "TIME_DELTA=1.7395833333333333": 895,
      "TIME_DELTA=1.325": 896,
      "TIME_DELTA=0.06666666666666665": 897,
      "TIME_DELTA=0.8229166666666665": 898,
      "TIME_DELTA=1.427083333333334": 899,
      "TIME_DELTA=0.031249999999998224": 900,
      "TIME_DELTA=2.34375": 901,
      "TIME_DELTA=1.7291666666666667": 902,
      "TIME_DELTA=0.6583333333333332": 903,
      "TIME_DELTA=1.3916666666666666": 904,
      "TIME_DELTA=0.35416666666666663": 905,
      "TIME_DELTA=0.41666666666666663": 906,
      "TIME_DELTA=1.3166666666666667": 907,
      "TIME_DELTA=1.7604166666666667": 908,
      "TIME_DELTA=0.3583333333333325": 909,
      "TIME_DELTA=1.35": 910,
      "TIME_DELTA=2.2083333333333335": 911,
      "TIME_DELTA=1.114583333333333": 912,
      "TIME_DELTA=1.104166666666667": 913,
      "TIME_DELTA=1.489583333333334": 914,
      "TIME_DELTA=1.7708333333333333": 915,
      "TIME_DELTA=2.40625": 916,
      "TIME_DELTA=0.8541666666666679": 917,
      "TIME_DELTA=1.447916666666666": 918,
      "TIME_DELTA=0.052083333333333315": 919,
      "TIME_DELTA=1.166666666666667": 920,
      "TIME_DELTA=1.8229166666666667": 921,
      "TIME_DELTA=0.4833333333333334": 922,
      "TIME_DELTA=0.8645833333333335": 923,
      "TIME_DELTA=0.5520833333333333": 924,
      "TIME_DELTA=1.3666666666666667": 925,
      "TIME_DELTA=0.1499999999999999": 926,
      "TIME_DELTA=1.3416666666666666": 927,
      "TIME_DELTA=1.8020833333333333": 928,
      "TIME_DELTA=0.8541666666666665": 929,
      "TIME_DELTA=1.3833333333333333": 930,
      "TIME_DELTA=0.031250000000001776": 931,
      "TIME_DELTA=1.145833333333333": 932,
      "TIME_DELTA=1.135416666666667": 933,
      "TIME_DELTA=1.479166666666666": 934,
      "TIME_DELTA=1.541666666666666": 935,
      "TIME_DELTA=1.208333333333333": 936,
      "TIME_DELTA=1.4083333333333334": 937,
      "TIME_DELTA=0.10000000000000009": 938,
      "TIME_DELTA=2.4375": 939,
      "TIME_DELTA=0.6041666666666667": 940,
      "TIME_DELTA=2.625": 941,
      "TIME_DELTA=0.13541666666666669": 942,
      "TIME_DELTA=0.07499999999999996": 943,
      "TIME_DELTA=0.4250000000000007": 944,
      "TIME_DELTA=2.0104166666666665": 945,
      "TIME_DELTA=1.4": 946,
      "TIME_DELTA=0.5729166666666667": 947,
      "TIME_DELTA=1.177083333333333": 948,
      "TIME_DELTA=1.583333333333334": 949,
      "TIME_DELTA=0.07291666666666669": 950,
      "TIME_DELTA=0.8854166666666679": 951,
      "TIME_DELTA=0.38541666666666663": 952,
      "TIME_DELTA=1.8541666666666667": 953,
      "TIME_DELTA=0.5166666666666666": 954,
      "TIME_DELTA=0.9166666666666679": 955,
      "TIME_DELTA=0.5083333333333329": 956,
      "TIME_DELTA=2.2916666666666665": 957,
      "TIME_DELTA=0.031249999999999112": 958,
      "TIME_DELTA=0.9583333333333335": 959,
      "TIME_DELTA=0.20833333333333331": 960,
      "TIME_DELTA=0.8645833333333321": 961,
      "TIME_DELTA=0.8958333333333321": 962,
      "TIME_DELTA=1.520833333333334": 963,
      "TIME_DELTA=4.440892098500626e-16": 964,
      "TIME_DELTA=1.425": 965,
      "TIME_DELTA=0.6666666666666667": 966,
      "TIME_DELTA=1.8958333333333333": 967,
      "TIME_DELTA=1.4833333333333334": 968,
      "TIME_DELTA=1.4916666666666667": 969,
      "TIME_DELTA=0.7166666666666668": 970,
      "TIME_DELTA=0.49166666666666714": 971,
      "TIME_DELTA=1.8854166666666667": 972,
      "TIME_DELTA=0.8854166666666665": 973,
      "TIME_DELTA=1.45": 974,
      "TIME_DELTA=0.14583333333333331": 975,
      "TIME_DELTA=0.5999999999999996": 976,
      "TIME_DELTA=1.510416666666666": 977,
      "TIME_DELTA=1.239583333333333": 978,
      "TIME_DELTA=1.8645833333333333": 979,
      "TIME_DELTA=1.4333333333333333": 980,
      "TIME_DELTA=2.3333333333333335": 981,
      "TIME_DELTA=0.36458333333333337": 982,
      "TIME_DELTA=1.552083333333334": 983,
      "TIME_DELTA=0.3666666666666667": 984,
      "TIME_DELTA=0.062499999999998224": 985,
      "TIME_DELTA=0.10416666666666669": 986,
      "TIME_DELTA=0.6145833333333333": 987,
      "TIME_DELTA=0.7083333333333333": 988,
      "TIME_DELTA=0.9166666666666665": 989,
      "TIME_DELTA=0.2749999999999999": 990,
      "NOTE_OFF=103": 991,
      "NOTE_ON=103": 992,
      "TIME_DELTA=1.475": 993,
      "TIME_DELTA=0.06250000000000178": 994,
      "TIME_DELTA=1.5166666666666666": 995,
      "TIME_DELTA=0.13333333333333375": 996,
      "TIME_DELTA=2.0729166666666665": 997,
      "TIME_DELTA=0.9270833333333321": 998,
      "TIME_DELTA=2.75": 999,
      "TIME_DELTA=0.8958333333333335": 1000,
      "TIME_DELTA=0.18333333333333335": 1001,
      "TIME_DELTA=0.9583333333333321": 1002,
      "TIME_DELTA=1.9479166666666667": 1003,
      "TIME_DELTA=2.46875": 1004,
      "TIME_DELTA=0.6354166666666667": 1005,
      "TIME_DELTA=1.197916666666667": 1006,
      "TIME_DELTA=0.3833333333333333": 1007,
      "TIME_DELTA=0.03125000000000089": 1008,
      "TIME_DELTA=1.291666666666667": 1009,
      "TIME_DELTA=2.0208333333333335": 1010,
      "TIME_DELTA=1.9270833333333333": 1011,
      "TIME_DELTA=1.4666666666666666": 1012,
      "TIME_DELTA=0.4499999999999993": 1013,
      "TIME_DELTA=1.333333333333333": 1014,
      "TIME_DELTA=1.4416666666666667": 1015,
      "TIME_DELTA=1.604166666666666": 1016,
      "TIME_DELTA=2.1354166666666665": 1017,
      "TIME_DELTA=2.53125": 1018,
      "TIME_DELTA=0.6458333333333333": 1019,
      "TIME_DELTA=1.572916666666666": 1020,
      "TIME_DELTA=0.11666666666666625": 1021,
      "TIME_DELTA=0.3916666666666675": 1022,
      "TIME_DELTA=2.1041666666666665": 1023,
      "TIME_DELTA=1.614583333333334": 1024,
      "TIME_DELTA=1.9791666666666667": 1025,
      "TIME_DELTA=1.5083333333333333": 1026,
      "TIME_DELTA=0.4249999999999998": 1027,
      "TIME_DELTA=0.39583333333333337": 1028,
      "TIME_DELTA=0.6770833333333333": 1029,
      "TIME_DELTA=0.01666666666666572": 1030,
      "TIME_DELTA=0.12499999999999822": 1031,
      "TIME_DELTA=0.9270833333333335": 1032,
      "TIME_DELTA=0.6916666666666664": 1033,
      "TIME_DELTA=2.5625": 1034,
      "TIME_DELTA=1.525": 1035,
      "TIME_DELTA=0.06249999999999911": 1036,
      "TIME_DELTA=1.666666666666666": 1037,
      "TIME_DELTA=2.0520833333333335": 1038,
      "TIME_DELTA=0.06250000000000089": 1039,
      "TIME_DELTA=0.19791666666666669": 1040,
      "TIME_DELTA=1.302083333333333": 1041,
      "TIME_DELTA=0.9479166666666665": 1042,
      "TIME_DELTA=0.12499999999999911": 1043,
      "TIME_DELTA=0.25833333333333375": 1044,
      "TIME_DELTA=1.645833333333334": 1045,
      "TIME_DELTA=0.2250000000000001": 1046,
      "TIME_DELTA=1.229166666666667": 1047,
      "TIME_DELTA=0.09374999999999822": 1048,
      "TIME_DELTA=0.6500000000000004": 1049,
      "TIME_DELTA=0.12500000000000178": 1050,
      "TIME_DELTA=1.5666666666666667": 1051,
      "TIME_DELTA=1.9895833333333333": 1052,
      "TIME_DELTA=0.9479166666666679": 1053,
      "TIME_DELTA=0.11458333333333331": 1054,
      "TIME_DELTA=1.5583333333333333": 1055,
      "TIME_DELTA=2.4583333333333335": 1056,
      "TIME_DELTA=1.575": 1057,
      "TIME_DELTA=1.260416666666667": 1058,
      "TIME_DELTA=1.270833333333333": 1059,
      "TIME_DELTA=1.635416666666666": 1060,
      "TIME_DELTA=0.17708333333333331": 1061,
      "TIME_DELTA=0.4500000000000002": 1062,
      "TIME_DELTA=0.45833333333333337": 1063,
      "TIME_DELTA=1.0416666666666665": 1064,
      "TIME_DELTA=2.4166666666666665": 1065,
      "TIME_DELTA=0.10833333333333428": 1066,
      "TIME_DELTA=0.09375000000000178": 1067,
      "TIME_DELTA=2.59375": 1068,
      "TIME_DELTA=0.09375000000000089": 1069,
      "TIME_DELTA=1.55": 1070,
      "TIME_DELTA=0.07500000000000107": 1071,
      "TIME_DELTA=0.1250000000000009": 1072,
      "TIME_DELTA=1.6083333333333334": 1073,
      "TIME_DELTA=1.5333333333333334": 1074,
      "TIME_DELTA=0.6979166666666667": 1075,
      "TIME_DELTA=0.7291666666666667": 1076,
      "TIME_DELTA=0.9895833333333321": 1077,
      "TIME_DELTA=1.6166666666666667": 1078,
      "TIME_DELTA=2.875": 1079,
      "TIME_DELTA=0.6833333333333336": 1080,
      "TIME_DELTA=1.708333333333334": 1081,
      "TIME_DELTA=0.09374999999999911": 1082,
      "TIME_DELTA=1.677083333333334": 1083,
      "TIME_DELTA=1.6333333333333333": 1084,
      "TIME_DELTA=0.44791666666666663": 1085,
      "TIME_DELTA=1.791666666666666": 1086,
      "TIME_DELTA=0.9791666666666665": 1087,
      "TIME_DELTA=0.050000000000000044": 1088,
      "TIME_DELTA=1.6": 1089,
      "TIME_DELTA=1.65": 1090,
      "TIME_DELTA=1.6416666666666666": 1091,
      "TIME_DELTA=2.1145833333333335": 1092,
      "TIME_DELTA=0.2812499999999991": 1093,
      "TIME_DELTA=0.6166666666666671": 1094,
      "TIME_DELTA=2.1458333333333335": 1095,
      "TIME_DELTA=0.2812500000000009": 1096,
      "TIME_DELTA=0.6083333333333334": 1097,
      "TIME_DELTA=1.0104166666666679": 1098,
      "TIME_DELTA=1.5916666666666666": 1099,
      "TIME_DELTA=0.7916666666666667": 1100,
      "TIME_DELTA=0.1562499999999991": 1101,
      "TIME_DELTA=1.0104166666666665": 1102,
      "TIME_DELTA=2.5416666666666665": 1103,
      "TIME_DELTA=0.3124999999999991": 1104,
      "TIME_DELTA=0.42708333333333337": 1105,
      "TIME_DELTA=1.0208333333333335": 1106,
      "TIME_DELTA=0.15624999999999822": 1107,
      "TIME_DELTA=0.19166666666666665": 1108,
      "TIME_DELTA=2.1770833333333335": 1109,
      "TIME_DELTA=1.0833333333333335": 1110,
      "TIME_DELTA=0.7833333333333332": 1111,
      "TIME_DELTA=1.7333333333333334": 1112,
      "TIME_DELTA=0.9895833333333335": 1113,
      "TIME_DELTA=1.0416666666666679": 1114,
      "TIME_DELTA=2.1979166666666665": 1115,
      "TIME_DELTA=0.9791666666666679": 1116,
      "TIME_DELTA=1.364583333333333": 1117,
      "TIME_DELTA=0.1562500000000009": 1118,
      "TIME_DELTA=1.322916666666667": 1119,
      "TIME_DELTA=0.4833333333333325": 1120,
      "TIME_DELTA=0.24166666666666625": 1121,
      "TIME_DELTA=0.2499999999999991": 1122,
      "TIME_DELTA=1.739583333333334": 1123,
      "TIME_DELTA=0.08333333333333334": 1124,
      "TIME_DELTA=0.22916666666666669": 1125,
      "TIME_DELTA=2.2604166666666665": 1126,
      "TIME_DELTA=2.65625": 1127,
      "TIME_DELTA=0.3125000000000009": 1128,
      "TIME_DELTA=2.2291666666666665": 1129,
      "TIME_DELTA=2.6875": 1130,
      "TIME_DELTA=1.416666666666667": 1131,
      "TIME_DELTA=1.833333333333334": 1132,
      "TIME_DELTA=1.395833333333333": 1133,
      "TIME_DELTA=0.3437499999999991": 1134,
      "TIME_DELTA=1.0208333333333321": 1135,
      "TIME_DELTA=0.5500000000000007": 1136,
      "TIME_DELTA=1.458333333333333": 1137,
      "TIME_DELTA=1.6583333333333334": 1138,
      "TIME_DELTA=2.71875": 1139,
      "TIME_DELTA=0.09166666666666667": 1140,
      "TIME_DELTA=0.18749999999999822": 1141,
      "TIME_DELTA=1.6833333333333333": 1142,
      "TIME_DELTA=2.2708333333333335": 1143,
      "TIME_DELTA=0.7395833333333333": 1144,
      "TIME_DELTA=1.729166666666666": 1145,
      "TIME_DELTA=0.1874999999999991": 1146,
      "TIME_DELTA=0.1875000000000009": 1147,
      "TIME_DELTA=1.0520833333333321": 1148,
      "TIME_DELTA=0.04166666666666666": 1149,
      "TIME_DELTA=1.760416666666666": 1150,
      "TIME_DELTA=1.725": 1151,
      "TIME_DELTA=0.23958333333333331": 1152,
      "TIME_DELTA=1.675": 1153,
      "TIME_DELTA=2.2395833333333335": 1154,
      "TIME_DELTA=0.2187499999999991": 1155,
      "TIME_DELTA=0.3749999999999991": 1156,
      "TIME_DELTA=0.2500000000000009": 1157,
      "TIME_DELTA=1.697916666666666": 1158,
      "TIME_DELTA=0.14166666666666572": 1159,
      "TIME_DELTA=0.3750000000000009": 1160,
      "TIME_DELTA=0.6333333333333329": 1161,
      "TIME_DELTA=1.0833333333333321": 1162,
      "TIME_DELTA=0.18750000000000178": 1163,
      "TIME_DELTA=1.822916666666666": 1164,
      "TIME_DELTA=0.5166666666666675": 1165,
      "TIME_DELTA=0.6416666666666666": 1166,
      "TIME_DELTA=0.7249999999999996": 1167,
      "TIME_DELTA=1.885416666666666": 1168,
      "TIME_DELTA=3.0": 1169,
      "TIME_DELTA=0.2187500000000009": 1170,
      "TIME_DELTA=0.15625000000000178": 1171,
      "TIME_DELTA=1.7": 1172,
      "TIME_DELTA=0.3500000000000001": 1173,
      "TIME_DELTA=0.7604166666666667": 1174,
      "TIME_DELTA=1.0520833333333335": 1175,
      "TIME_DELTA=0.031249999999999556": 1176,
      "TIME_DELTA=1.6916666666666667": 1177,
      "TIME_DELTA=1.770833333333334": 1178,
      "TIME_DELTA=2.5833333333333335": 1179,
      "TIME_DELTA=0.8416666666666668": 1180,
      "TIME_DELTA=0.058333333333333126": 1181,
      "TIME_DELTA=0.47916666666666663": 1182,
      "TIME_DELTA=1.854166666666666": 1183,
      "TIME_DELTA=0.21874999999999822": 1184,
      "TIME_DELTA=2.3541666666666665": 1185,
      "TIME_DELTA=0.8020833333333333": 1186,
      "TIME_DELTA=0.031250000000000444": 1187,
      "TIME_DELTA=1.427083333333333": 1188,
      "TIME_DELTA=1.7666666666666666": 1189,
      "TIME_DELTA=0.4916666666666667": 1190,
      "TIME_DELTA=1.7416666666666667": 1191,
      "TIME_DELTA=1.802083333333334": 1192,
      "TIME_DELTA=1.916666666666666": 1193,
      "TIME_DELTA=0.2666666666666657": 1194,
      "TIME_DELTA=0.4062499999999991": 1195,
      "TIME_DELTA=0.8333333333333333": 1196,
      "TIME_DELTA=1.0729166666666665": 1197,
      "TIME_DELTA=0.010416666666666657": 1198,
      "TIME_DELTA=0.5749999999999993": 1199,
      "TIME_DELTA=0.21875000000000178": 1200,
      "TIME_DELTA=1.775": 1201,
      "TIME_DELTA=1.1666666666666665": 1202,
      "TIME_DELTA=0.049999999999998934": 1203,
      "TIME_DELTA=0.7708333333333333": 1204,
      "TIME_DELTA=1.489583333333333": 1205,
      "TIME_DELTA=1.354166666666667": 1206,
      "TIME_DELTA=1.0729166666666679": 1207,
      "TIME_DELTA=0.020833333333333343": 1208,
      "TIME_DELTA=1.385416666666667": 1209,
      "TIME_DELTA=1.7583333333333333": 1210,
      "TIME_DELTA=3.125": 1211,
      "TIME_DELTA=0.3437500000000009": 1212,
      "TIME_DELTA=0.07291666666666666": 1213,
      "TIME_DELTA=1.1145833333333335": 1214,
      "TIME_DELTA=2.3020833333333335": 1215,
      "TIME_DELTA=2.3229166666666665": 1216,
      "TIME_DELTA=1.7166666666666666": 1217,
      "TIME_DELTA=2.78125": 1218,
      "TIME_DELTA=1.2083333333333335": 1219,
      "TIME_DELTA=1.447916666666667": 1220,
      "TIME_DELTA=0.062499999999999556": 1221,
      "TIME_DELTA=2.84375": 1222,
      "TIME_DELTA=2.3645833333333335": 1223,
      "TIME_DELTA=1.1458333333333335": 1224,
      "TIME_DELTA=0.19999999999999996": 1225,
      "TIME_DELTA=0.28124999999999956": 1226,
      "TIME_DELTA=1.958333333333334": 1227,
      "TIME_DELTA=0.4062500000000009": 1228,
      "TIME_DELTA=0.28125000000000044": 1229,
      "TIME_DELTA=1.479166666666667": 1230,
      "TIME_DELTA=2.8125": 1231,
      "TIME_DELTA=1.541666666666667": 1232,
      "TIME_DELTA=2.3854166666666665": 1233,
      "TIME_DELTA=0.4374999999999991": 1234,
      "TIME_DELTA=1.8": 1235,
      "TIME_DELTA=1.7833333333333334": 1236,
      "TIME_DELTA=0.2500000000000018": 1237,
